[{"name": "65daysofstatic plays No Man's Sky", "links": ["http://www.65daysofstatic.com", "https://soundcloud.com/65daysofstatic", "http://www.no-mans-sky.com"], "title": "Presented by Playstation España", "country": "UK", "venue": "Sónar by Day - SonarComplex", "hour": "22:00 - 22:45", "link": "https://sonar.es/en/2016/artists/65daysofstatic-plays-no-man-s-sky", "day": "Thursday 16", "description": "65daysofstatic will touch down at Sónar to offer a very special performance at SonarComplex. The band are responsible for the music for \"No Man's Sky\", the latest spectacular PlayStation®4 game, and their new live show will showcase the game's infinite soundtrack generated in procedural audio form. The Sheffield group have been commissioned to compose and perform the game's score using their distinctive, absorbent and expansive sound, which fits perfectly with the aesthetic of the giant space epic \"No Man's Sky\". The game has already won several awards and is one of 2016's most anticipated releases.\r\n\r\n65daysofstatic formed in Sheffield in 2001 and have since released six instrumental music albums and multiple EPs, effortlessly moving between various genres (post-rock, jazz, electronica) using noise as an essential element. The quartet currently consists of Robert Jones (drums), Joe Shrewsbury (guitars), Paul Wolinski (piano, guitar, programming) and Simon Wright (bass, synthesizer). They have developed a unique sound adaptable to any given situation and location, from northern European clubs to American road bars, Siberian stores, British museums or Australian jungles. Among the many projects they have been involved with it is worth mentioning: their online remixes in real time (under the name Prisms); an infinite duration piece made on an open-source platform; adaptations of works for dance and television (BBC); and an experimental short film, \"Oscillator\", which they also directed."},
{"name": "Acid Arab", "links": ["https://soundcloud.com/acid-arab"], "title": "Fusion of worlds", "country": "Versatile /  FR", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "16:30 - 18:00", "link": "https://sonar.es/en/2016/artists/acid-arab", "day": "Thursday 16", "description": "In their own unique way, Parisians Guido Minisky and Herve Carvalho have given birth to a new form of world music: an intense and sharp techno and house sound seamlessly blended with melodies, harmonies, chants and Arabic sounds. The result is one of the most exciting fusions of global electronic dance sounds that can be heard today; modern, intoxicating, and powerfully evocative music. Just take a look at any of thier videos on YouTube, watch their sets (e.g. the excellent mix for French magazine Tsugi) or listen to the recent \"Djazirat el Maghreb EP\" and fall under the spell of a sound that combines the best dance sounds from both Eastern and Western cultures.\r\n\r\nIt all started when Minisky and Carvalho -both experienced club DJs and residents at Paris’s Chez Moune- travelled to Tunisia together with another key name of French electronica, dj Gilb'R. Fascinated by what they heard they began to experiment with these sounds, sharing their discoveries with other like-minded producers and musicians, who were invited to join the project. Henceforth came the singles and the subsequent compilation \"Acid Arab Collections\" a high tide mark of today’s Arab Acid project, which included the participation of among others Crackboy (remixing Omar Souleyman), Pilooski, Etienne Jaumet and I: Cube. Since then, and with the support of label Versatile (run by Gilb'R), the Parisian duo has continued to explore their exquisite combination of acid and Maghreb music (and beyond: Kurdistan, Pakistan, India) in dj sessions, remixes and EPs, to a powerful and addictive effect."},
{"name": "Alizzz", "links": ["https://soundcloud.com/alizzz"], "title": "Neon beats", "country": "ES", "venue": "Sónar by Night - SonarPub", "hour": "22:00 - 23:00", "link": "https://sonar.es/en/2016/artists/alizzz", "day": "Saturday 18", "description": "Extremely well known in Barcelona and on the national dance music circuit, last year the talented Cristian Quirante also began to win over European and American audiences. Hardly surprising when his mastery when combining futuristic r&b, indie pop and dance music is more than worthy of all the praise and success that has enjoyed since he first began as Alizzz in 2013. His work rate during this time has been nothing short of frenetic, with 3 EPs in 3 years (the latest, \"Sunshine\" was released on Jeffree's, a sister label to Diplo’s Mad Decent) and countless remixes and edits spread across several platforms. His song \"Your Love\" featured the voice of Max Marshall and rose quickly in last year’s Spotify charts, achieving over half a million worldwide listeners. He is currently working on a new EP, due for imminent release, and several remixes that will appear throughout 2016. His set at this year’s Sónar by Night will open the SonarPub stage on Saturday night, before the Santigold concert.\r\n\r\nFormally recording as Pisu, on the label Música Vermella, with his new alias Alizzz, Quirante has discovered his very own sound, leading him to tour throughout the United States, Australia and Japan. His tracks have received support from today’s foremost electronic luminaries including Ryan Hemsworth, Baauer, Canblaster and collectives like Diplo and Mad Decent, Fool's Gold and LuckyMe. His \"Whoa\" EP on Galician label Arkestra in 2013, remains one of the most important albums released in Spain this decade. His polished infectious beats work equally well on the dance floor as in the charts. They are also the perfect platform for all kinds of MC’s to rhyme freely over."},
{"name": "Alva Noto", "links": ["http://www.alvanoto.com/"], "title": "Master of Sound", "country": "raster-noton /  DE", "venue": "Sónar by Day - SonarComplex", "hour": "17:00 - 18:00", "link": "https://sonar.es/en/2016/artists/alva-noto", "day": "Saturday 18", "description": "A key figure in the exploration of cutting edge electronic music this century, Alva Noto will pen yet another chapter in his long and fruitful relationship with Sónar by performing for the 20th anniversary of raster-noton, the label he founded with Olaf Bender and Frank Brettschneider in 1996. In April last year the German artist released \"Xerrox Vol. 3\", the last in a series of albums that incorporates the name of his self-designed composition software. The album was inspired by very personal influences, such as Jules Verne or the soundtrack of \"Solaris\" by Andrei Tarkovsky. This opened the door to emotions associated with nostalgia and Noto’s own memories, which can be heard in his archetypally mathematical electronic music and dynamic soundscapes. Most recently, he collaborated with Ryuichi Sakamoto on the soundtrack for \"The Revenant\", the film by Alejandro González-Iñarritu, which has just received 12 nominations for the 2016 Oscars.\r\n\r\nBehind the Alva Noto moniker we find Carsten Nicolai, one of the most important sound explorers of our time. A student of Architecture in his formative years and a visual artist always interested in the physical qualities of sound, Nicolai has worked on many projects, both on his own and with other artists including: Ryuichi Sakamoto, Bretschneider (Signal), Bender (Diamond Version), Blixa Bargeld (NBBA) and Ryoji Ikeda (Cyclo), among many others. Sónar has had the honour of hosting several of his projects over the years, among them the large digital installation 'Unidisplay', a work that featured in the first edition of SónarPlanta. Nicolai is permanently in a state of flux and will give us a taste of his new Alva Noto material via one of his scientifically precise audiovisual shows that will further demonstrate his growing interest in dance music rhythms."},
{"name": "Angel Molina", "links": [], "title": "25 years in the trenches", "country": "ES", "venue": "Sónar by Night - SonarClub", "hour": "21:30 - 22:25", "link": "https://sonar.es/en/2016/artists/angel-molina", "day": "Friday 17", "description": "Extremely versatile and steadfastly committed to his art, 2016 sees Angel Molina celebrate twenty-five years as a DJ. To mark this occasion he will complete yet another chapter in his long and fruitful relationship with Sónar, by taking charge of SonarClub and offering up an extended set before Jean-Michel Jarre's performance on the same stage. It will not only be our birthday gift to him, but also to everyone in the crows.\r\n\r\nAngel Molina is a DJ's DJ - One of the few people who lend dignity to the term and to his profession. Aside from his staggering technical skills and exquisite taste, he is also capable of blending an unimaginable quantity of genres in his sets. With an excellent understanding of the importance of performance, Molina often plays around with the concept of the show. His sets are not only dance driven, they are also musical expeditions that question genres, identities and the conventions of an electronic soundscape which he has helped shape since the 90s."},
{"name": "Astrolith", "links": [], "title": "Hard beats", "country": "Space Is The Place /  US", "venue": "Sónar by Day - SonarDôme", "hour": "14:50 - 15:35", "link": "https://sonar.es/en/2016/artists/astrolith", "day": "Saturday 18", "description": "Evan Sutton (also known as Astrolith) is a producer and engineer based in New York City. Aside from being a first call production whiz for artists like Vince Clarke (of Erasure and Depeche Mode) and Daniel Platzman (of Imagine Dragons), he is an in-demand remixer, recently working with Imagine Dragons, Spank Rock, and X Ambassadors to name a few. As Astrolith, his productions blend elements of hip hop and techno, distilling his forward-thinking, aggressive approach to club music. As a live performer, he has a knack for rocking crowds with sets consisting entirely of original music. As a recording and mix engineer, Sutton’s roster continues to grow. He’s recently worked with Erasure, CHVRCHES, Spank Rock, Jovanotti, Cakes Da Killa, Remy Banks (and the World’s Fair crew), Ruff Ryders, and Mt. Eden to name a few. Sutton attended Berklee College of music, and was a participant at RBMA Paris in 2015."},
{"name": "Ata Kak", "links": ["https://soundcloud.com/atakak"], "title": "It began in Ghana", "country": "Awesome Tapes From Africa /  GH", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "17:00 - 17:45", "link": "https://sonar.es/en/2016/artists/ata-kak", "day": "Friday 17", "description": "After spending many months tracing leads and solving potential re-release problems, Awesome Tapes From Africa finally announced their intention to reissue Ata kak for the first time since 1994. As expected, the western world responded more than enthusiastically: everyone who hears \"Obaa Sima\" for the first time is instantly hooked by its simple rhythms, frenetic raps and originality. Fact Magazine, an important online music trends website, proclaimed it the most important reissue of 2015, and reviews have been unanimously positive in all major media across America and Europe. More than twenty years on from the album’s first recording, Ata Kak will now come to Europe to present his amazing songs at SonarVillage, where a party vibe is guaranteed.\r\n\r\nAta Kak’s history is a curious one. In 94 he released an album on cassette format called \"Obaa Sima\", which at the time virtually no one listened to. It was soon buried beneath a plethora of other tapes and records being sold in Ghana’s major city markets. However, eight years later, one of these tapes caught the attention of a young New York ethnomusicologist, Brian Shimkovitz, who was fascinated by the strange mix of highlife (a celebratory African genre close to funk) and Western style rap. That tape, and one track in particular, \"Moma Yendolo\" would give rise to Awesome Tapes From Africa, the popular blog where Shimkovitz would post the best tapes he had bought during his travels to the continent, which later became a key label in the dissemination of African sounds. In fact Shimkovitz partly created the label to officially release \"Obaa Sima\", and share with the world this exciting, addictive and intoxicating music that we will soon enjoy on the green grass at Sónar by Day."},
{"name": "Awwz", "links": ["http://www.awwz.club/", "https://soundcloud.com/awwz"], "title": "Shower Music", "country": "Galaxxxy Sandwich  /  ES", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "14:00 - 15:00", "link": "https://sonar.es/en/2016/artists/awwz", "day": "Friday 17", "description": "Behind the four onomatopoeic letters lies the young but experienced Barcelona producer who is catching the attention of everyone in the city’s vibrant scene. The reason for this interest and acclaim is largely thanks to her work \"Glid\", a five track EP released on new artistic platform Galaxxxy Sandwich, hailing from the Egyptian Maraccas label. On \"Glid\" (which in Swedish means \"slide\") Awwz pens an alluring sound mixing future beats, pop and r&b, with translucent melodies, sensual vocals and slow and simmering imaginative rhythms. Awwz will perform on Friday at Sónar by Day by opening proceedings on the green grass of SonarVillage. She will be accompanied (on a couple of tracks) by Bearoid, another of Barcelona’s young and upcoming producers and EP collaborator.\r\n\r\nAwwz is the new project from Gemma. She began her artistic career as part of the Thug Ladies duo, performing at several of Spain’s key festivals and venues, especially at Razzmatazz, where she honed her skills as resident DJ. As a solo artist, Awwz debuted with the \"Gals\" EP on American label Freshmore, which received excellent feedback both in Spain and Latin America and saw her perform in Mexico and Colombia. Awwz has created her own unique brand with just a handful of tracks that she describes as \"shower music\". This is visually illustrated in the fantastic interactive video for her song, \"Awake\"."},
{"name": "Badbadnotgood", "links": ["https://badbadnotgood.com/", "https://soundcloud.com/badbadnotgood/here-and-now"], "title": "Off road jazz combo", "country": "Innovative Leisure /  CA", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "16:00 - 17:00", "link": "https://sonar.es/en/2016/artists/badbadnotgood", "day": "Saturday 18", "description": "Formed in Toronto in 2011, the extremely gifted and versatile musicians of BBNG; Matthew Tavares (keyboards), Chester Hansen (bass) and Alex Sowinski (drums), have from the outset moved seamlessly between genres, aiming to break down the barriers between them. They accomplish this with considerable ease on albums such as \"III\", a muscular instrumental workout, and especially on \"Sour Soul\" - the outstanding jazz-funk-rap album recorded last year with the indefatigable Ghostface Killah - that shows off to the full the incredible musical bond between the band members. The band have also collaborated with other heavyweight hip-hop producers including DOOM, and more recently paid their respects to another integral figure in contemporary electronic music, James Blake, with two incredible cover versions of his tracks, \"CMYK\" and \"Limit To Your Love\". As of January 2016 they have expanded from a trio to form a quartet, being joined by saxophonist Leland Whitty.\r\n\r\nHip-hop has always been at the centre of the Canadian jazzmen’s musical obsessions and they do not shy away from sampling classic bass lines from the genre, as seen on the LP \"BBNG\" and the EP \"BBNG2\" (both self-released). As proof of their deep knowlege and love for the genre, they have collaborated with artists including Frank Ocean, Tyler The Creator, Danny Brown, Earl Sweatshirt, RZA and the great Bootsy Collins (among others); providing a full-bodied yet flexible instrumental backdrop for their accomplices in the studio. While Badbadnotgood begin with jazz and have hip-hop as their ostensible destination, they touch upon everything along the way, from funk, post-punk and African rhythms to dance music."},
{"name": "Baelish", "links": ["https://soundcloud.com/baelishmusic", "http://moltsrecords.bandcamp.com/album/new-era"], "title": "Floating synths", "country": "Molts Records /  ES", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "13:00 - 14:15", "link": "https://sonar.es/en/2016/artists/baelish", "day": "Thursday 16", "description": "Baelish is the new project from Barcelona based producer Carlos Guinart, which momentarily sees him move away from the sounds of bass and electronic dance music, that for several years he has cultivated via his Check One alias. For this new adventure, Guinart will arrive at Sónar laden with spatial synthesizers, cosmic pianos, slowed down rhythms and floating atmospheres that draw on dystopian and wide-open soundscapes. These concepts are clearly demonstrated on “New Era”, the first EP released on the Catalan Molts Records label, to which he has been affiliated since its inception. Baelish will play six songs from the EP live at SonarVillage, on Thursday 16th June, which will be his first concert of 2016.\r\n\r\nGuinart is not new to music production. His best-known work to date was produced under his Check One pseudonym, which saw him experiment with his passion for styles including hip hop, dancehall, dubstep and funk. His EP \"Scherbe” was released on German label Dub Bullet Rec. in 2008, and his performance at Sónar that same year were pivotal points in his career and also confirmed his status as one of dubstep’s pioneers. Until now his sound has been characterized by the forceful nature of his rhythms and bass lines, with a danceable element as a common denominator. As Baelish, a ‘new era’ is indeed born, which also relates to the birth of his first daughter."},
{"name": "Ben Klock", "links": ["https://soundcloud.com/ben-klock"], "title": "Hard & heart", "country": "Klockworks /  DE", "venue": "Sónar by Night - SonarLab", "hour": "05:30 - 07:00", "link": "https://sonar.es/en/2016/artists/ben-klock", "day": "Saturday 18", "description": "A fixture in Resident Advisor’s top-10 DJs for the best part of a decade, Ben Klock needs little introduction. With a long-term residency at Berghain, it is with the notorious Berlin institution that he is most commonly associated, but the intricate yet powerful nature of his sets have seen him become one of most in-demand techno artists of the current generation. Those who have witnessed him perform will note not only the diversity in his track selection, but also his ability to create a room rather than just play for it. Focus, over recent years, has been on touring—but his early works, released primarily via Ostgut Ton, have become landmark releases in the imprint’s impressive discography. His seminal 2009 album, titled “One,” continues to form a reference point for all long-players within the techno genre. In addition to this, he also runs Klockworks, a label founded in 2006 that has housed releases from DVS1, Etapp Kyle and Klock himself."},
{"name": "Ben UFO b2b Helena Hauff", "links": ["https://soundcloud.com/benufo", "https://soundcloud.com/helena-hauff", "http://www.helena-hauff.com"], "title": "Four prodigious hands", "country": "UK / DE", "venue": "Sónar by Night - SonarLab", "hour": "03:00 - 05:00", "link": "https://sonar.es/en/2016/artists/ben-ufo-b2b-helena-hauff", "day": "Friday 17", "description": "Sónar 2016 and Resident Advisor are honoured to bring together for the very first time, a DJ set from two of the most exciting and relevant DJs today: the widely respected Brit; Hessle Audio label boss Ben UFO; and Germany's Helena Hauff, resident DJ at the cult Golden Pudel club in Hamburg and an outstanding producer of infectious dark techno. Both will convene behind the decks at Sónar by Night in what is looking to be one of the sets of the festival; we can expect to hear an abundance of high quality unreleased material, dance floor friendly techno, EBM, oblique house and as yet unheard mixes from them both. What a luxurious treat for Sónar by Night.\r\n\r\nFor many years both Ben and Helena have received much deserved respect and praise from both specialist press and the discerning public alike. The English DJ has slowly become one of the world's most admired DJs without feeling the need to produce. This has allowed him to fully concentrate all his creativity on his continuously impeccable and open-minded sets, which combine the best in techno, experimental breaks, tribal tracks and any sounds that inspire him. His kudos can easily be measured by the amount of other DJs that regard him so highly. Meanwhile Hauff has taken a major step forward from her home in Hamburg to the forefront of the European techno scene, without ever betraying her passion for industrial rhythms, dark and minimal wave and underground electronica. Her quality is perfectly embodied by \"Discreet Desires\" her latest album on Werk (Actress' label), as well as her singles on Ninja Tune and PAN and her experimental project Black Sites."},
{"name": "Bicep", "links": ["http://www.feelmybicep.com/", "https://soundcloud.com/feelmybicep"], "title": "Muscular house", "country": "Feel My Bicep /  UK", "venue": "Sónar by Night - SonarLab", "hour": "04:00 - 05:30", "link": "https://sonar.es/en/2016/artists/bicep", "day": "Saturday 18", "description": "As Bicep, Matt McBriar and Andy Ferguson have created their own unique world: a creative nucleus, a popular DJ team and an extended identity through the Feel My Bicep alias, their blog and publishing platform. Each of their brands is synonymous with robust energetic house music, as deep as it is magnetic, flirting with both Detroit techno and an underground disco sound. Since they first began releasing albums five years ago, they have not stopped producing and putting out material: just last year they released four EPs, two of them on their own label, one on Aus Music and another on 50Weapons, the latter together with Benjamin Damage and Doc Daneeka. The Northern Irish duo have perfectly assimilated their sources of inspiration and know exactly how to shape them into a concise and individual sound, ideal at winning over any dance floor in any given situation.\r\n\r\nFor nearly a decade McBriar and Ferguson’s activity has been extremely intense: they have collaborated and shared releases with other prominent names from the British scene including: Ejeca, Simian Mobile Disco and Midland; they have remixed Blood Orange, Disclosure, Blondes and Catalans, Aster, among others; In 2014 they recorded one of the best Essential Mixes for BBC Radio 1; and have released almost twenty singles, EPs and tracks on labels like Throne of Blood, Traveller and Aus. As if this were not enough; in addition to running their own label and regularly updating their blog; they are common fixtures at some of the world’s biggest club nights, including of course, Manchester’s Warehouse Project."},
{"name": "Bob Moses", "links": ["http://bobmosesmusic.com", "https://soundcloud.com/the-bob-moses"], "title": "In search of the perfect electronic song", "country": "Domino /  CA", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "20:00 - 21:00", "link": "https://sonar.es/en/2016/artists/bob-moses", "day": "Thursday 16", "description": "Born and raised in Canada but now working from New York, the duo comprised of Tom Howie and Jimmy Vallance operate at the intersection where silky contemporary electronica meets classic pop composition. In fact their songs uncover the myriad of possibilities that exist when combining these elements. Their debut album, \"Days Gone By\", released on Domino in September 2015, draws from their continual quest for perfection, both in rhythm (r&b, house, electronica and impeccable production) and the lyrical use of vocals. Their synth pop delights are at times reminiscent of Hot Chip at their most poetic, or outstanding bands like Metronomy, Chromatics and other renowned Canadian band Junior Boys –their sound is also not a million miles away from that of James Blake-. Their concert will therefore be perfectly placed under the sunshine, on the grass in the magical atmosphere of SónarVillage, the main stage at Sónar by Day.\r\n\r\nVallance and Howie met at the Vancouver School of Art, but it was not until several years later following a chance encounter that led to their joint project. Their medium paced sophisticated and captivating house music quickly caught the attention of Brooklyn label Scissor & Thread, whose like minded artists include Black Light Smoke and Frank & Tony. The label released their first two EPs, \"Hands To Hold\" and \"Far From The Tree\" with which they began to win over their first fan base and saw their subsequent move to prominent label Domino. Their music effortlessly captures the contrast between the nocturnal euphoria and melancholia of the big city."},
{"name": "Booka Shade", "links": ["http://bookashade.com/", "https://soundcloud.com/booka-shade"], "title": "Dance revision", "country": "Get Physical /  DE", "venue": "Sónar by Night - SonarClub", "hour": "01:30 - 02:30", "link": "https://sonar.es/en/2016/artists/booka-shade", "day": "Saturday 18", "description": "Booka Shade will be presenting the world premiere of their new show at Sónar by Night. 'Movements 10' is a jaw dropping production that includes lasers, cutting edge light design and visuals crafted especially for the show, which celebrates the 10th anniversary of their era-defining LP 'Movements'. As well as the show the duo have re-issued the album in a remastered edition featuring remixes by Nils Frahm, Deetron, M.A.N.D.Y. and Eats Everything (who plays immediately following their show at SonarClub).\r\n\r\nMerziger and Kammermeier founded influential label Get Physical in 2002, together with M.A.N.D.Y. and DJ T. They also contributed directly to the label’s expansion releasing their first three LPs, “Memento” (2004), “Movements” (2006) & “The Sun & The Neon Light” (2008), followed by “More!” (2010) and “Eve” (2013). In addition to their proven skills in effortlessly combining irresistible rhythms with melodic hooks, the Berlin duo has always stood out for their spectacular live shows, which constantly feature among the favourites in the annual Resident Advisor lists. This led them to be chosen by Depeche Mode as road and stage companions for one of their recent tours. They have also produced several remixes for artists and bands including Moby, Yello, Hot Chip, Tiga and The Knife, among many others."},
{"name": "Boys Noize", "links": ["https://soundcloud.com/boysnoize"], "title": "World premiere", "country": "DE", "venue": "Sónar by Night - SonarPub", "hour": "03:35 - 04:50", "link": "https://sonar.es/en/2016/artists/boys-noize", "day": "Saturday 18", "description": "Alex Ridha, better known as Boys Noize, will present the worldwide premiere of his new show at Sónar Barcelona. Ten years after his first steps towards the international stage, the german producer conceived a new live spectacle together with visual artists Sus Boy and Lil Internet, exploring a focused thematic narrative with visual and scenic elements inspired by cyberpunk, 80's industrial, surveillance in contemporary society and the light, dark and greys of the struggle between humans and technology. The new show is closely linked to the presentation of his recently released fourth LP ‘Mayday’, featuring collaborations from Hudson Mohawke, Poliça, Spank Rock and Benga, among others. The album further consolidates Boys Noize’s signature sound - a blend of acid, banging techno and euphoric electro that he’s renowned for.\r\n\r\nHe has collaborated with Chilly Gonzales, Snoop Dogg, Santigold and Tiga, remixed Daft Punk, Depeche Mode and Nine Inch Nails, contributed to Oliver Stone's Snowden film soundtrack, formed the Dog Blood duo together with Skrillex, and much more. He celebrated his label´s 100th release with remixes by Chemical Brothers and Justice, and marked the 10th anniversary of Boysnoize Records last year. With over 150 acclaimed releases that have become DJ set staples of both big rooms and basements, his Berlin based imprint has formed a league of its own including artists such as Djedjotronic, Siriusmo, SCNTST, Peaches, Spank Rock, Hoshina Anniversary and Cardopusher. 2ManyDJ's have said \"Boys Noize is the only DJ who can play underground techno for 30,000 people.\" If you don't believe them, you can see for yourself at Boys Noize's 2016 Sonar live show debut. The equation is simple: Sónar by Night + Boys Noize = Fire."},
{"name": "bRUNA & Wooky + Alba G. Corral", "links": ["http://www.soundcloud.com/bruna", "http://www.soundcloud.com/wooky", "http://blog.albagcorral.com"], "title": "Electronic partners with a special guest", "country": "Lapsus /  ES", "venue": "Sónar by Day - SonarHall", "hour": "14:30 - 15:25", "link": "https://sonar.es/en/2016/artists/bruna-wooky-alba-g-corral", "day": "Saturday 18", "description": "As seasoned producers, Sónar regulars for many years and accomplices in Lapsus (a label, festival and radio show) the artistic union between bRUNA and Wooky was perhaps inevitable. For this new adventure, Guajardo and Salinas jump into the uncharted waters of experimental electronica and will jointly release new material (one side for each producer) that is currently in the process of final mastering. Their live show, which will premiere at Sónar by Day, includes a very special ingredient: none other than Alba G. Corral, one of Spain’s leading visual artists.\r\n\r\nCarles Guajardo, aka bRUNA, began dabbling with keyboards and two turntables at the tender age of 7 and has not stopped making music since. Ex Red Bull Music Academy student (Toronto, 2007), his debut album \"And It Matters To Me To See You Smiling\" (spa.RK, 2009) was a revelation, confirmed four years later by his second album \"Thence\". Albert Salinas (Wooky) burst onto the scene a little later in 2010, initially with EP \"The Ark\", the first release on Lapsus Records. In 2014 he released his debut album \"Montjuïc\", also on spa.RK, an exquisite and extremely personal album that received ‘best of the year’ mentions among key magazines and online media. Meanwhile, Alba G. Corral has spent several years lending his amazing visual talent to a wide range of artists, including Shackleton, RZA, Tree, Jon Hopkins and Angel Molina, among many others."},
{"name": "Byetone", "links": ["http://www.raster-noton.net/artists/byetone"], "title": "Precision Techno", "country": "", "venue": "Sónar by Day - SonarComplex", "hour": "20:00 - 21:00", "link": "https://sonar.es/en/2016/artists/byetone", "day": "Saturday 18", "description": "Olaf Bender together with Carsten Nicolai are the heart and soul of raster-noton. Label founder, operations director and the man behind its impeccable graphic design, Bender is also largely responsible for the label’s shift in recent years, from its original sound towards more dance floor friendly music. Following his two most recent and essential LPs signed under the Byetone pseudonym, and the Diamond Version alias (another project with Nicolai), Bender is now working on new material, so far without a title or an official release date. However, some of this may well be aired as part of the raster-noton 20-year Anniversary showcase at Sónar.\r\n\r\nA cult figure in Berlin IDM and minimal techno circles, Bender first caused a stir in 2008 with the release of \"Plastic Star\" followed immediately by the album \"Death of a Typographer\". Both releases breathed new life into the label’s electronic clicks and cuts, thanks to the introduction of powerful 4x4 bass drums and their own unique brand of club music and rhythmic patterns; developments that do not take away from the basic identity of the label, but delved further into ideas of expression and hypnotic effects. The penetrating and powerful sound of \"Death...\" was repeated on the follow up album \"Symeta\" released in 2011. Its live adaptation saw a series of extraordinary concerts that showcased the precise synchronization between image and sound, fundamental characteristics in all raster-noton shows, led by its finest exponent Byetone."},
{"name": "Cauto", "links": ["https://soundcloud.com/cauto"], "title": "Emotion, experimentation and dance", "country": "Disboot /  ES", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "14:15 - 15:30", "link": "https://sonar.es/en/2016/artists/cauto", "day": "Thursday 16", "description": "Cauto’s comeback is great news for 2016. The Catalan producer has returned from his self imposed exile in Berlin with an abundance of ideas and sounds, which he has slowly cultivated into his new surreally entitled work: “Prova a veure si ets capaç de menjar pedres” (Let’s see if you can eat stones). Due to be released mid-April on Barcelona label Disboot, it is his first full length record in a solo career spanning more than 8 years, and an album into which he has poured all his influences and sonic obsessions. Cauto will not arrive at Sónar alone: he will be accompanied by his childhood friend Dani Guijarro, aka Headbirds, with whom he produces under the C156 pseudonym, and who has also been his long standing partner in crime onstage.\r\n\r\nFrom the combination of his classical and modern childhood education; the influence of techno and hip-hop in his late teens; and the dubstep and breakcore of his young adulthood; emerges the heterogeneous and personal sound of Cauto (Pau Encinas). The Catalan musician continues to search for the perfect balance between emotion, experimentation and dance, both as a producer, live performer (he is an experienced violin player) and through his dj sets. These elements are clearly audible in his releases as C156 (a collaborative project with Headbirds, Dr. Res and The Gardener) and the excellent EPs \"Awakening\" and \"35/8\", both tracks which happily reappear on his highly anticipated debut album."},
{"name": "Club Cheval", "links": ["https://soundcloud.com/clubcheval"], "title": "Killer quartet", "country": "Parlophone /  FR", "venue": "Sónar by Day - SonarDôme", "hour": "19:20 - 20:20", "link": "https://sonar.es/en/2016/artists/club-cheval", "day": "Saturday 18", "description": "Consisting of Sam Tiba, Myd, Canblaster and Panteros666, Club Cheval are take-no-prisoners party starters of the highest order. Originally surfacing via releases on Top Billin’ and Bromance Records, the ubiquitous Frenchmen effortlessly fuse electro, house and Underground Resistance-style electronics to create their trademark high energy sound, in plentiful supply on their roaring EP From The Basement To The Roof and latest collaborative single “Discipline.” In the past, Club Cheval have remixed the likes of Boys Noize, Two Door Cinema Club and Vitalic, and Club Cheval member Canblaster is also an RBMA alumnus, with a background in making music for computer games that informs the pixelated atmospheres, furious changes and power-ups in his solo tracks."},
{"name": "Congo Natty feat. Congo Dubz, Tenor Fly, Nãnci & Phoebe", "links": ["http://congonatty.com/"], "title": "Jungle Vibez", "country": "Bid Dada /  UK", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "18:00 - 19:00", "link": "https://sonar.es/en/2016/artists/congo-natty-feat-congo-dubz-tenor-fly-nanci-phoebe", "day": "Friday 17", "description": "What better place than SonarVillage to enjoy the very best in jungle and reggae from one of its seasoned pros: Congo Natty. With a long and established career behind him, British born Michael West -Natty- (aka Rebel MC and Conquering Lion) is once again making waves thanks to the album \"Jungle Revolution\", released on Ninja Tune imprint Big Dada. The unadulterated Jamaican flavour of the Jungle LP was mixed by dub magician Adrian Sherwood and features many renowned guests, several of whom will accompany him live on stage at Sónar: Right hand man Congo Dubz; mythical toaster Tenor Fly; and Nãnci Correia and Phoebe Hibbert, vocalists from London duo Irondread. This all-star British drum'n'bass and ragga team will guarantee nonstop dancing and jubilation on the grass at Sónar by Day.\r\n\r\nWest became widely known through his Rebel MC alias and formed part of the 80s electro-ragga quartet Double Trouble, with whom he broke into the charts thanks to the hit \"Tuff City\". Soon afterwards he began his solo career which saw him move away from hip-hop towards reggae, dancehall, dub, and above all, the 100% British genre jungle. With a style heavily indebted to his Jamaican roots, these are clearly visible in the titles of his first two albums: \"Tribute to Haile Selassie I\" (2000) and \"Lion In The Jungle\" (2001). For this new outing Congo Natty collaborated with some of the genre’s top artists, bringing together the best MCs and vocalists of his generation, including Barrington Levy, Tenor Fly and Dennis Brown. His latest release, the \"Jungle Revolution\" remix album also includes new DJs and producers including Dj Madd, Sukh Knight and Mungos Hi-Fi, as well as battle-hardened masters like Adrian Sherwood. It is a real treat to have him appear at Sónar."},
{"name": "Coyu", "links": ["https://soundcloud.com/coyu"], "title": "Night cat", "country": "Suara /  ES", "venue": "Sónar by Night - SonarClub", "hour": "00:05 - 01:25", "link": "https://sonar.es/en/2016/artists/coyu", "day": "Saturday 18", "description": "Known throughout the European circuit as “The Big Cat”, Catalan Coyu has long been one of the major producers and DJs on the international house and techno scene, a status well-earned thanks to his patience, self-confidence and the excellence of his work as head of Suara, the label whose releases havewho have regularly charted on Beatport and Resident Advisor since its inception in 2008. This year, with the feline aesthetic of Coyu and Suara coinciding with the image of Sónar 2016, he will play a set at Sónar by Night on Saturday 18 following New Order. The set will also feature visuals from his usual onstage accomplice, GaAs, where cats will be omnipresent.\r\n\r\nAfter remixing artists like Fatboy Slim, Pete Tong, Moby or Stephan Bodzin, Coyu threw himself into his own music with great success, producing tracks including “The Cat” (Hot Creations), “Profound Pleasure” (Defected) “Balls”, “Cygnus” (the latter two on Suara) and others for Innervisions and Drumcode. Since then he has tirelessly toured the world and expanded his fan base, regularly sharing the booth with dj luminaries, while releasing material on labels like Get Physical, Bedrock and Cocoon."},
{"name": "Craze", "links": ["http://www.djcraze.com/", "https://soundcloud.com/crazearoni"], "title": "Turntable wizard", "country": "Slow Roast /  us", "venue": "Sónar by Night - SonarPub", "hour": "02:15 - 03:25", "link": "https://sonar.es/en/2016/artists/craze", "day": "Saturday 18", "description": "Among the greatest turntablists ever, Craze was the first to make the leap to the big stage and who best knew how to transfer the intricacies of scratching to a successful dance floor sound. Craze knows everything there is to know about the art of DJing. His technique is amazing, virtually unparalleled, but he also possesses other equally important qualities: excellent taste and an innate intuition on exactly what the next record's melody, tempo and style should be. Acting as a thematic bridge between the Skepta and Boys Noize shows at SonarPub, his set on Saturday 18 at Sónar by Night promises to be one of the festival's most spectacular.\r\n\r\nAristh Delgado was born in Nicaragua, but raised in Miami; Craze first began to demonstrate his cross fader scratch skills at a very young age. At 20 he won the first of his three consecutive DMC World Championships titles -the competition for the world's most important djs- and at 23 was named best DJ in America by Time Magazine. In addition to his behind the turntables aptitude, Craze runs his own label, Slow Roast Records; has recorded numerous albums –some with leading figures of hip hop, jungle and turntablism, such as Q-Bert, Del The Funky Homosapien, and Dj Hype-; and in 2008 was selected to perform on Kanye West's Glow in the Dark tour. Craze continues to release material (most recently last year's \"Baby Gurl EP\") and wow audiences around the world with his extraordinary sets encompassing rap, dubstep, Miami bass and any other style he pleases."},
{"name": "Cyclo", "links": ["http://www.ryojiikeda.com/project/cyclo/"], "title": "Sound + Vision", "country": "raster-norton /  JP-DE", "venue": "Sónar by Day - SonarComplex", "hour": "18:30 - 19:30", "link": "https://sonar.es/en/2016/artists/cyclo", "day": "Saturday 18", "description": "Cyclo brings together two of the world’s most important digital artists; Japan's Ryoji Ikeda and Germany's Carsten Nicolai. Tireless sonic investigators, their objective as Cyclo is to give shape to the visualization of sound and to discover new hybridizations between the visual arts and digital music. More than just concerts, Nicolai and Ikeda will put forward highly technological sensory impacting shows affecting retinas and eardrums that mix repetitive algorithmic techno with powerful visual interpretations of their sound. This essentially means that the images will not just accompany the music, but in fact in most cases: the images ARE the music. The raster-noton 20th anniversary showcase would not be the same without them.\r\n\r\nCyclo formed following the combined performances by Nicolai and Ikeda in the \"New Forms\" series of concerts held in Leipzig in 1999. What originally began as a occasional collaboration has become a long-term project and has progressed over time, whenever their busy schedules have allowed. Nicolai and Ikeda –who live and work regularly in Paris- share an obsession with digital sound quality, the physicality of ultrasonic frequencies and the limits of human hearing; in addition to concepts like the error, or the results of incorrect mathematical calculations. The duo has released two albums, \"·\" (2001) and \"Go\" (2011), both on raster-noton, and the book “cyclo.id: Vol. 1”; but beyond conventional physical formats, they are continually researching new compositional forms and expanding their database, the \"Cyclopedia\", comprised of sounds that have been selected on the basis of their post analytical visual response."},
{"name": "Danny L. Harle", "links": ["https://soundcloud.com/dannylharle"], "title": "Fantasy XXI Pop", "country": "PC Music /  UK", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "19:00 - 20:00", "link": "https://sonar.es/en/2016/artists/danny-l-harle", "day": "Friday 17", "description": "A confessed fan of 90s hits like “Rhythm Is A Dancer” (Corona) or “What Is Love?” (Haddaway), Danny L. Harle is one of the most important and popular artists on PC Music, the music and lifestyle revolution created by AG Cook. Harle’s music fits the movement perfectly: naive neon pop melodies, pitched up childlike voices and a homage to genres as reviled as europop; filtered through state of the art production methods and tools. The resulting sound has scandalized purists whilst enthusing an audience seeking fresh sounds and frivolity in contrast to the staid nature of much of today's electronic pop music. Harle’s set at SonarVillage will therefore be an event not to be missed for those craving fun at Sónar by Day, and also those who wish to experience firsthand one of the most unusual phenomena’s in recent music history.\r\n\r\nHarle's new EP includes a new version of the much loved banger “Broken Flowers”, and marks the beginning of a collaboration with the multinational label Columbia - a clear indication that PC Music's objectives are to storm the world’s charts in the immediate future. In addition to his promising solo career, the young London producer -son of a saxophonist and himself a former free jazz musician - has launched the Dux Content project together with the movement’s main instigator and his childhood friend, A.G. Cook. He has also remixed the emerging British pop trio Years & Years and revered American musician Panda Bear. His next steps may bring him closer to the world of R&B and who knows; it could even lead to him to collaborate with Nicki Minaj, an artist for whom he has expressed admiration."},
{"name": "David August (live band)", "links": ["https://soundcloud.com/davidaugust"], "title": "Youthful ambitious talent", "country": "DE", "venue": "Sónar by Day - SonarHall", "hour": "20:30 - 21:30", "link": "https://sonar.es/en/2016/artists/david-august-live-band", "day": "Thursday 16", "description": "Ever since the excellent \"Instant Harmony\" EP appeared in 2010 on Diynamic (Solomun’s label), David Augusts’ name has continued to appear regularly on the European house and electronic music circuit. The young musician from Hamburg (currently living in Berlin) moves effortlessly between dance music and classical composition, already producing a sizeable discography in which both the synthetic and organic perfectly coalesce. For him, there is little difference between adding a digital bass line to a house track and writing a score to a classical song with string arrangements. It is therefore unsurprising that after just a few singles August felt he needed to work with a band to evolve as a musician and continue to expand his sound in new directions. At Sónar we will see the fruits of his labour, where he will be accompanied on stage by his trusted musicians, allowing him to share this particularly creative period, where everything has fallen into place and anything is possible.\r\n\r\nBorn in 1990, August grew up in a very musical environment: his father is a pianist and his mother often played him many of the great works in classical music, both canonical and contemporary. At 5 years old he began to play the piano, at 15 he became interested in electronic dance music and dj’ing, and by 18 he was remixing tracks with considerable ease. A year later at 19, he released his first single on Stil Vor Talent, with the help of Oliver Koletzki. Besides his albums on Stil Vor Talent and Diynamic (including the 2013 LP \"Times\") it is also worth mentioning his EP \"Epikur\" released on the prestigious German label Innervisions, home to Dixon and  Âme. August has just released the first track of his new EP, titled “J.B.Y. / Ouvert”, on the Ninja Tune Imprint Counter Records in London digitally."},
{"name": "Dawn Of Midi", "links": ["http://www.dawnofmidi.com/", "https://soundcloud.com/dawn-of-midi"], "title": "Electrifying minimalism", "country": "Erased Tapes /  US", "venue": "Sónar by Day - L'Auditori", "hour": "21:15 - 22:30", "link": "https://sonar.es/en/2016/artists/dawn-of-midi", "day": "Thursday 16", "description": "\"It sounds like nothing else right now\", said The Guardian in a recent review of this Brooklyn-based trio formed by Qasim Naqvi (drums), Aakaash Israni (bass) and Amino Belyamani (piano). This is certainly the case, as there are few bands that resemble them. Dawn Of Midi make contemporary instrumental and minimalist music with acoustic instruments, which sounds like cutting edge and experimental electronica. With this in mind they can perhaps be compared to bands like Elektroguzzi or Brandt Brauer Frick, although the final result is different, closer at times to Plastikman’s first forays into scientific techno or at other times the repetitive depth of Steve Reich. The trio debut in Barcelona for two concerts at Sónar 2016, one on Thursday 16 at the Auditori, and another on Friday 17 at SonarComplex (Sónar by Day).\r\n\r\nThe music of Dawn Of Midi is perfectly embodied by the album \"Dysnomia\", released originally in 2013 and recently reissued by Erased Tapes. On this album, the American trio replace improvisation with composition, shaping visceral, physical, complex and open sounds, increasingly influenced by structures and melodies from Morocco, India and Pakistan (the countries where these three instrumentalists can trace their origins). When playing live, their haunting and hypnotic effect is even greater, giving rise to a pure trancelike ceremony where we experience how each musician plays their instrument, far beyond long established conventional forms of music."},
{"name": "DJ EZ", "links": ["http://www.djez.com/", "https://soundcloud.com/djez"], "title": "UK Garage Legend", "country": "UK", "venue": "Sónar by Night - SonarLab", "hour": "23:30 - 00:30", "link": "https://sonar.es/en/2016/artists/dj-ez", "day": "Saturday 18", "description": "DJ EZ is the personification of the UK garage sound, the London based genre which in his hands still sounds as fresh and magnetic as when it first appeared. Originally from Tottenham, North London, the legendary DJ EZ (Otis Roberts) has been fully active over the last few years. His incredible sets combine the very best in today’s garage, bass music and London style house, with the classics of the late 90s and early 2000s. His mixing expertise and sound selection is perfectly demonstrated by last year’s set for the Essential Mix series, two hours of pure London music without a single wasted second. DJ EZ debuts at Sónar on Saturday night at SonarLab, and expectations could not be higher.\r\n\r\nDJ EZ’s (pronounced EEE ZED) fame and reputation is entirely deserved. His long-standing experience and technical skills enable him to dominate the art of mixing like no other, and his genre knowledge of garage, 2 step, grime and UK funky is encyclopaedic. He has experienced moments of huge success in a career that began on pirate radio stations: the genre defining compilation mix series \"Pure Garage\"; his amazing Boiler Room set in 2012, a landmark in the British platform’s output; and his contribution to the London club Fabric cd-mix series. Recently DJEZ also took part in a one of a kind fundraising initiative; a 24 hour DJ set, raising over 60,000 pounds for Cancer Research UK."},
{"name": "Drippin", "links": ["https://soundcloud.com/drippin"], "title": "Icy beats", "country": "", "venue": "Sónar by Day - SonarDôme", "hour": "18:20 - 19:10", "link": "https://sonar.es/en/2016/artists/drippin", "day": "Saturday 18", "description": "Erik Spanne, AKA Drippin, is a young beatmaker with a flair for unique and compelling takes on club music of all types –eerie, erogenous, and evocative. Based in Norway, he produces duly icy riddims, specializing in the kind of spacious and chilling pan-genre club thumpers of contemporaries like Nguzunguzu and Fatima Al Qadiri. In fact it was through Al Qadiri that the Norwegian producer first linked with J-Cush, whose Lit City Trax label released Drippin's ‘Silver Cloak’ EP in 2014. Drippin has also laced New York avant-rapper Le1f and Chicago bop duo Sicko Mobb with a few beats."},
{"name": "DVS1 & Rødhåd", "links": ["https://soundcloud.com/rodhad", "https://soundcloud.com/dvs1"], "title": "Techno squared", "country": "US-DE", "venue": "Sónar by Night - SonarLab", "hour": "05:00 - 07:00", "link": "https://sonar.es/en/2016/artists/dvs1-rodhad", "day": "Friday 17", "description": "Bringing the proceedings to a close at the SonarLab stage on Friday night, Resident Advisor presents an exciting duel between two masters of techno: The American DVS1 (pronounced “devious one”) along with Berlin's Rødhåd. Although hailing from different scenes and generations, they both share the same approach to producing and DJing, where energy, complexity and depth are the primary components of their sound. There is another detail that can be applied equally to both: the quintessential technique that allows them to mix any track from any spectrum of techno, dub or house with great fluency and imagination, fully focused on the dance floor.\r\n\r\nZak Khutoretsky, aka DVS1, is a central figure of American underground techno, from taking his first steps in Midwest raves and New York acid house nights in the early '90s, to today, where he travels around the world as one of Berlin’s Berghain resident DJs. Of Russian descent, Khutoretsky homes in on the powerful, physical side of techno , both in his sets and on EPs released on Klockworks (Ben Klock), Transmat (Derrick May) or his own imprints Hush and Mistress Recordings. Rødhåd also cut his teeth at illegal parties, in his case Berlin in the late 90s, and has slowly been establishing himself as one of the most tenacious techno artists to emerge from the German capital, mixing -both in his sets and productions- techno-dub with dry percussion and digital grooves. In 2009 he began his dystopian nights at the Arena Club in the Kreuzberg district, and in 2012 founded his label under the same name, which has released much of his excellent material to date."},
{"name": "Eats Everything", "links": ["https://soundcloud.com/eatseverything"], "title": "Luscious dance music", "country": "UK", "venue": "Sónar by Night - SonarClub", "hour": "02:35 - 03:55", "link": "https://sonar.es/en/2016/artists/eats-everything", "day": "Saturday 18", "description": "Few artists have made such an impressive impact in the world of dance music as Dan Pearce, the man behind the Eats Everything alias. And few can claim to be as busy. The British DJ and producer has barely stopped working since the release of his classic “Entrance Song” in 2011, and has played across the globe alongside the leading DJs of his generation. His chosen weapons are no secret: elastic beats indebted to funk, dance floor house music in its many forms, and an expansive personality that can clearly be seen in all of his sets. If what you seek is non-stop dancing and abandoning your body to magical rhythms, Saturday at SonarClub with Eats Everything is an absolute must.\r\n\r\nThe Bristol based housemaster has for five consecutive years built an incredible reputation by obliterating all dance floors in his path and releasing a plethora of material that always carries his indelible mark. His discography includes songs released on several seminal labels (2020 Vision, Get Physical, Hypercolour, Futureboogie, Crosstown Rebels); a comprehensive and open-minded collection of edits; an already legendary Essential Mix for BBC Radio 1 entitled “Edits Everything”; remixes for Jamie Jones, Disclosure and Four Tet; collaborations and sets with Seth Troxler, Jackmaster, Claude Von Stroke; and typically powerful sets (always with a sense of humour) in which contemporary house is mixed seamlessly with garage, techno funk, bass music and even drum'n'bass."},
{"name": "Ed Banger House Party: Busy P + Para One + Boston Bun", "links": ["http://www.edbangerrecords.com/", "https://soundcloud.com/para-one/tracks", "https://soundcloud.com/bbbostonbun/tracks"], "title": "Party in Village", "country": "Ed Banger /  FR", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "21:00 - 23:00", "link": "https://sonar.es/en/2016/artists/ed-banger-house-party-busy-p-para-one-boston-bun", "day": "Saturday 18", "description": "Among French house labels, Ed Banger is perhaps the most important, and its roster of artists like Busy P, Para One and Boston Bun best define the label’s current output. All three share a hedonistic spirit, a love of dance music, lack of prejudice and abundant skills behind the decks. They will close Saturday at SónarVillage (and therefore the day shift of Sónar 2016), which is set to be truly memorable. Expect large doses of house both old and new, cosmic disco, mutant funk, bombastic hip-hop beats and endless dance-floor gems for a nonstop dancing experience.\r\n\r\nThibaud Noyer, aka Boston Bun, has effortlessly slotted into the Ed Banger family thanks to the quality of his music which fluctuates between sophisticated house and dance-floor electro. His latest 12\" perhaps best defines him as a producer with its compact sound and by its title: \"Paris Groove\". Long-time acquaintances of famous rap group TTC, Para One retain hip-hop in their DNA while also moving towards an electronic sound rich in nuances and rhythms, embodied by noteworthy albums including \"Passion\" (2012) and \"Club\" (2014). Meanwhile Pedro Winter -Busy P- still heads the group he founded 12 years ago, fresh from being Daft Punk’s manager in their early years. As a dj he has become a key ambassador for the Paris scene and French electronica throughout the world."},
{"name": "El Guincho", "links": ["http://hiperasia.style/", "https://soundcloud.com/pablodiazreixa"], "title": "HiperMusic", "country": "Canada /  ES", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "15:00 - 16:00", "link": "https://sonar.es/en/2016/artists/el-guincho", "day": "Friday 17", "description": "Allergic to stagnation and revisiting old ideas, Pablo Diaz-Reixa has added another twist to his sound with El Guincho’s new album \"HiperAsia\". The album was inspired by a Chinese superstore of the same name located in the outskirts of Madrid, where all kinds of products are mixed together in a huge unending space. A similar claim can be made of the album: Broken beats, oblique sounds and sophisticated melodies mixed with his own voice, modulated in a thousand different ways, and a feature by Spanish rapper 'La Mala Rodriguez with onthe first single, \"Comix\", featuring Mala Rodriguez. While El Guincho retains his catchy pop aesthetic and his unusual incomparable talent for weaving words and sounds,  however his new album is markedly different from his much lauded early work inthe much celebrated \"Alegranza\" and \"Pop NegroBlack\". Diaz-Reixa will present his new songs live (at SonarVillage, Friday 19) supported by several backing musicians and a host of samplers, synthesizers and drum machines, plus a bass and lead guitar passing through multiple filters.\r\n\r\nThe musician and producer from the Canary Islands ies took his first steps into the music world while living in Barcelona. He played drums in the band Coconot and was part of underground projects such as La Orquesta de la Muerte and Dead Man On Campus. In 2006 he released \"Folias\", his first work as El Guincho, but received much wider recognition a year later for \"Alegranza\", one of the most innovative and remarkable records made in Spain overSpanish records of the last decade. Its impact was extraordinary, receiving plaudits across the globe. His second album, \"Pop NegroBlack\", released on British label Young Turks in 2010, once again garnered worldwide acclaim. His list of achievements also includes collaborating with Björk (inn the \"Biophilia\" era); productions for Los Punsetes and Extraperlo; and the \"Trances\" EP released last year on Hivern Disc."},
{"name": "Fatboy Slim", "links": ["http://www.fatboyslim.net/", "https://soundcloud.com/fatboyslim"], "title": "Funk Soul Brother", "country": "UK", "venue": "Sónar by Night - SonarClub", "hour": "04:00 - 05:30", "link": "https://sonar.es/en/2016/artists/fatboy-slim", "day": "Saturday 18", "description": "Following his triumphant first show for us four years ago, Fatboy Slim will return to Sónar with his new show, headlining the main SónarClub stage at Sónar by Night. A superstar  and advocate of the most open-minded party electronica, the English DJ and producer (Norman Cook on his passport) knows instinctively how to move the most timid of dance floors, thanks to a powerful and vibrant show and a catalogue of insurmountable hits. Cook -who recently began a series of parties in Las Vegas, performed on the Great Wall of China and played to 350,000 people in Rio de Janeiro- has perfectly managed the transition from his 90s stardom, reinventing himself without ever losing his identity, which can be defined by his expansive personality, his hilarious sense of humour and an unquestioned ability to lay down sure-fire hits for the dance floor.\r\n\r\nDuring the 80s Cook was bassist for the Housemartins, one of the UK’s most popular groups. Soon after he rapidly took command of the early 90s electronica scene with projects like Beats International and Freak Power, counting on first time hits like \"Dub Be Good To Me \"or\" Turn On, Tune In, Cop Out\", tracks overflowing with groove and built in listener anticipation. The big change came in 1996, when he invented the Fatboy Slim pseudonym, which has now become part of British dance music history. His chunky funky beats and contagious samples defined an era and can be heard almost anywhere in the world. Several of his videos also remain unrivalled, such as the legendary \"Praise You\" shot by Spike Jonze, or Christopher Walken dancing to \"Weapon of Choice\". Long accustomed to performing in front of large crowds, Brighton’s most famous producer knows exactly how to transform any situation and moment into a party, especially in the hallowed halls of Sónar."},
{"name": "FIELD by Martin Messier", "links": ["http://www.mmessier.com/"], "title": "Electromagnetic miracle", "country": "CA", "venue": "Sónar by Day - SonarComplex", "hour": "17:00 - 17:30", "link": "https://sonar.es/en/2016/artists/field-by-martin-messier", "day": "Thursday 16", "description": "\"FIELD\" is the new project from the prestigious Canadian artist Martin Messier whose work derives from one basic idea: the creation of sound from electromagnetic fields imperceptible to the naked eye and human ear. Messier utilises transducer microphones to capture these electrical signals, along with two large panels located on stage that allow him to connect any transmitter outputs to inputs, thereby shaping the sounds. The artists interacts through the continuous plugging and unplugging of connections to produce a composition of sound and light in real time, allowing us to listen to and observe powerful energetic material that would otherwise be inaudible and invisible. The end result is an amazing, incredibly physical show, mixing minimal sounds, electric shocks, shadow manipulation and energy converted into noise.\r\n\r\nThis new project confirms Martin Messier as an important artist who has shaped his own unique world through a completely original working process. A composer, sculptor, performer and video artist, the Canadian has interacted with sound using all kinds of material as the basis for his work, with each new piece redefining the concept of concrete music. Sónar has closely followed his career, having previously hosted several of his most important creations to date including: \"Machine Variation\", a large sculpture of pulleys, belts and levers created with Nicolas Bernier; \"The Sewing Machine Orchestra\" an installation producing sounds and compositions from several sewing machines; and \"La Chambre des Machines\" the precursor to the \"Machine Variation\" project -created with Barnier- which also paid tribute to the Intonarumori (noise machines) of futuristic Italian artist Luigi Russolo."},
{"name": "Flume", "links": ["http://www.flumemusic.com/", "https://soundcloud.com/flume"], "title": "Magnetic bass and beautiful pop", "country": "Future Classic /  AS", "venue": "Sónar by Night - SonarPub", "hour": "01:30 - 02:30", "link": "https://sonar.es/en/2016/artists/flume", "day": "Friday 17", "description": "The internationally successful Australian producer finally debuts at Sónar with his long-awaited concert. At just 25 years old, Edward Harley Streten -Flume to the rest of the world- lands in Barcelona to present the songs from his new and highly anticipated second album, \"Skin,\" released officially on May 26th. \"Skin\", full of collaborators such as Beck, Vince Staples, Raekwon and AlunaGeorge (among others) confirms Flume’s position as an essential part of the new electronic pop landscape, searching for the perfect balance between dance, beauty and the human voice. A meticulous and prodigious studio talent, Flume has produced worldwide smashes like \"Drop The Game\" (together with Chet Faker), \"Space Cadet\" (with guest vocals by Ghostface and Autre Ne Veut) and \"Some Minds\" (with Andrew Wyatt on the mic), and has also left his mark on remixes for Arcade Fire, Lorde, Junior Boys, Ta-Ku or Sam Smith, among others. His style, best described as the ideal blend between soul, pop, garage and house, has won the hearts of millions of fans that are eagerly awaiting the release of his imminent second album.\r\n\r\nBorn in Sydney in the early 90s, Streten began to create beats and melodies in his teenage years. A few years later he won a competition organized by the Future Classic label, with whom he signed his first contract in 2011. His debut song, \"Sleepless\" was released that same year achieving huge success in Australia. Soon after in November 2012 he released his comprehensive and eponymous album that was equally well received in the United States. Following this came an EP with Chet Faker, a tour with Disclosure (who he has remixed twice), four ARIA awards (the country’s most prestigious music prize), several Australian gigs opening for The xx, and the creation of ephemeral duo What So Not, together with Sydney DJ and producer Emoh Instead. He recently announced -via his Instagram account- February 1st as the possible release date for his highly anticipated new material."},
{"name": "Four Tet", "links": ["https://soundcloud.com/four-tet"], "title": "A seven-hour master class", "country": "Text /  UK", "venue": "Sónar by Night - SonarCar", "hour": "00:00 - 07:00", "link": "https://sonar.es/en/2016/artists/four-tet", "day": "Friday 17", "description": "Before Laurent Garnier will take over the SonarCar stage on Saturday at Sónar by Night with a special seven-hour set, Friday night it’s Four Tet’s turn. Unquestionably one of the most important producers on the international scene over the last decade, the British artist will demonstrate why he is also regarded as an exceptional dj. The secrets to the success of his dj sets is evident: his extraordinary knowledge of the history of music, his extremely discerning taste in selecting a treasure trove of tracks and his ability to effortlessly mix them together. Four Tet is interested in virtually any genre: techno, ambient, rock, jazz, house, funk, kraut, new wave, afro, hip-hop and bass music in all their guises and from any era. That said the Englishman carefully chooses only the very best from each genre, often tracks by lesser-known artists, thereby building his own alternative to the official mainstream history of music. This makes him the ideal choice to play an extended dj set at this year’s SonarCar on Friday at Sónar by Night.\r\n\r\nKieran Hebden is so much more than a dj and producer. His skillset and panoramic view of music have regularly enabled him to move sinuously between genres, making him a very special artist who is respected and admired by the public, press and peers alike. His first musical excursions saw him explore pastoral synthetic folk, make incursions into more experimental territor, all the while with a focus on creating glowing synthetic melodies. In recent years his output has skewed towards the dancefloor, reflecting a greater affection for dance tracks and club music. Some highlights from his varied career include: actively collaborating with jazz drummer Steve Reid, before his death; collaborating in the studio with Burial and Thom Yorke; heading post rock band, Fridge; dj’ing with regular cohorts Daphni and Floating Points; remixing a whole host of well known artists; releasing material under the Percussions alias; and running the Text Records label. He is without a doubt a total artist: taking on a host of projects and roles at the same time, and, more importantly doing them all amazingly. We’re thrilled to have him kick off this new and exciting format at SonarCar."},
{"name": "Gazelle Twin: Kingdom Come", "links": ["http://www.gazelletwin.com/", "https://soundcloud.com/gazelletwin"], "title": "An Audio-Visual Performance for Two Vocalists", "country": "UK", "venue": "Sónar by Day - SonarComplex", "hour": "20:00 - 21:00", "link": "https://sonar.es/en/2016/artists/gazelle-twin-kingdom-come", "day": "Thursday 16", "description": "The british artist Gazelle Twin will touch down at SonarComplex with a new show combining theatre, live music and new forms of storytelling, which will also play a major role at Sónar+D. \"Kingdom Come\" evokes the dystopian worlds of JG Ballard by merging on stage: images of empty shopping centres and car parks -created by filmmakers Chris Turner and Tash Tung-; an arresting presence of vocalists; and strange gym treadmills. The show was produced by Manchester's FutureEverything festival, and will be performed at Sónar by Day for only the third time since its creation.\r\n\r\nBehind the enigmatic name and image of Gazelle Twin is Brighton based artist and composer Elizabeth Bernholz. Her work is characterized by the creation of dark and dystopian universes, a desire to tackle challenging issues and an unconventional approach to performance. Her album \"Unflesh\" (2014) is a visceral meditation on puberty and phobias and was chosen as album of the year by the prestigious online magazine The Quietus, while receiving numerous accolades in The Guardian, Uncut and the New York Times. Over the past year she has been working on the piece \"Out Of Body\" with Carla MacKinnon and has toured the world presenting \"Fleshed Out\", a live version of the album, as well as working tirelessly on the \"Kingdom Come\" project."},
{"name": "Gerd Janson", "links": [], "title": "DJ Excellence", "country": "Running Back /  DE", "venue": "Sónar by Day - SonarDôme", "hour": "20:30 - 22:00", "link": "https://sonar.es/en/2016/artists/gerd-janson", "day": "Friday 17", "description": "Gerd Janson is the original Endor blender, touched with the ability to unearth treasured discs that make music lovers’ eyebrows arch and hips dip. He is one of modern house music’s most accomplished DJs, having held long residencies at two of the world’s most revered nightclubs, Robert Johnson in Frankfurt and Berghain/Panorama Bar in Berlin. His encyclopedic knowledge of house music history, coupled with a resolutely contemporary ear, has made his DJ sets essential listening over the past decade, while he’s continued putting out releases by the likes of Move D, Maurice Fulton, Radio Slave, Theo Parrish, Tensnake and many more via his own unclassifiable record label Running Back. A member of the Tuff City Kids production duo with Philip Lauer, a former writer for Groove and Spex and a longtime Red Bull Music Academy team member, there’s a special pride that goes along with seeing the rest of the world find out what we knew all along: Gerd is one of the best DJs in the game, reconfiguring classics in unexpected ways while also creating classics of his own, years before everyone else plays them out."},
{"name": "Golden Bug & Desilence - V.I.C.T.O.R.", "links": ["https://soundcloud.com/golden-bug", "http://v5.dslnc.com/"], "title": "Mapping sound", "country": "ES", "venue": "Sónar by Day - SonarComplex", "hour": "14:00 - 15:00", "link": "https://sonar.es/en/2016/artists/golden-bug-desilence-v-i-c-t-o-r", "day": "Friday 17", "description": "V.I.C.T.O.R. is a new audiovisual live show that unites French producer Antoine Harispuru, (better known as Golden Bug) with Barcelona art studio Desilence. This is a show that draws its initial inspiration from the famous Rubik Snake game (primarily its triangular structures) and in which parsimonious techno is mixed with organic visual and retro-futuristic mappings. The resulting work from these renowned and talented creators is a unique musical and visual experience that can be enjoyed on Friday 17, in the SonarComplex auditorium (Sónar by Day).\r\n\r\nHarispuru is a man of many interests and talents. Producer, remixer and La Belle label owner, the Frenchman –resident in Barcelona for several years- grew up in Paris surrounded by rudimentary instruments and accompanied by a robot called V.I.C.T.O.R. (the name he has given to his latest project). His music under the Golden Bug pseudonym -with a sound leaning towards disco- has been released on labels including Gomma and Bang Gang, receiving support from the likes of Erol Alkan, Andrew Weatherall and Prins Thomas among others. Meanwhile, Desilence is one of the most active visual artist teams in Barcelona, ​​formed by Tatiana Halbach and Søren Christensen. Both have spent more than a decade working in fields such as music, theatre and fashion without ever restricting the confines of their work and constantly renewing its aesthetical discourse."},
{"name": "Hiele", "links": ["https://soundcloud.com/hielehiele"], "title": "Man Machine", "country": "Ekster /  BE", "venue": "Sónar by Day - SonarDôme", "hour": "16:25 - 17:10", "link": "https://sonar.es/en/2016/artists/hiele", "day": "Friday 17", "description": "Roman Hiele (Belgium, 1991) is a composer and performer of electronic music.\r\nHiele's music surfaces in the form of hard to pin point electronica, build on a long time obsession for synthetic sound creation and jazz studies. On stage Hiele plays with expectation, going past what is considered conventional, blending improvisational and classical elements into a no-nonsense personal idiom.\r\nHiele has released his music on the Antwerp based label Ekster ( 2013,  2014). In 2016 YYAA Recordings released Hiele's performance in the Schinkel Pavilion, Berlin 2014. Recently (May 2016) Hiele has released \"Ritmische Bezinning\", his third album on Ekster.\r\nRoman Hiele has collaborated in the realms of fashion, documentary film, theatre and art productions."},
{"name": "HomeSick", "links": ["https://soundcloud.com/foreverhomesick", "http://www.homesick89.com/"], "title": "Footwork jungle", "country": "", "venue": "Sónar by Day - SonarDôme", "hour": "15:40 - 16:25", "link": "https://sonar.es/en/2016/artists/homesick", "day": "Saturday 18", "description": "If all you knew about HomeSick was the name of his blog, you’d have a pretty good idea of the music he makes. That name? Footwork-Jungle. The Calgary-based producer loves energetic music, wherever it comes from. In most cases, that means the internet: the place that he counts as the most inspirational in his creative life. As well as running his Footwork-Jungle blog, Homesick is a net artist who, IRL, runs a footwork night in Calgary called Percolate, is an adept jazz keyboardist, and harbours a deep love of fusion –there’s that love of speed, again– but when he’s producing his own music, it’s all about up-to-the-minute bass mutations from Chicago and the UK."},
{"name": "Hot Shotz (Powell + Lorenzo Senni)", "links": ["https://soundcloud.com/diagonal-records", "https://soundcloud.com/sennilorenzo"], "title": "Four handed deconstruction", "country": "UK-IT", "venue": "Sónar by Night - SonarLab", "hour": "22:30 - 23:30", "link": "https://sonar.es/en/2016/artists/hot-shotz-powell-lorenzo-senni", "day": "Friday 17", "description": "Hot Shotz is Oscar Powell and Lorenzo Senni; two of today’s most important experimental electronic artists. Although Powell leans more towards industrial sounds and primitive techno, while Senni draws from 90s trance as his main source of inspiration, both the British and Italian artists share a similar working method; deconstructing dance music patterns and structures, while maintaining basic elements to create new genre adaptations. Their alliance is therefore both logical and exciting, with the potential to open up new possibilities forfor experimental club music today. Pay great attention to what this partnership offers on Friday night at SonarLab.\r\n\r\nOscar Powell has revolutionized the British underground scene -and by extension, the international electronic scene- with his powerful productions and his manifesto for Diagonal, the label he runs with Jamie Williams. Powell has instigated a radical and inflammatory sound with his own music and also through the output of label artists including Prostitutes, Shit & Shine and the mighty Russell Haswell. Meanwhile, Lorenzo Senni -who also runs his own label, Presto?! has astounded even the most sceptical of listeners with albums like “Quantum Jelly” (on Mego) or “Superimpositions” (on Boomkat Editions), which have confirmed him as a tireless investigator and one of the most important innovators in today’s dance music mechanisms."},
{"name": "Howling", "links": ["http://howlinghowling.com/", "https://soundcloud.com/howlinghowling"], "title": "Spellbinding howls", "country": "Monkeytown /  AS-DE", "venue": "Sónar by Day - SonarHall", "hour": "20:30 - 21:30", "link": "https://sonar.es/en/2016/artists/howling", "day": "Saturday 18", "description": "‘Howling’ has several definitions: it can mean \"terrible\" or even \"awesome\", and in an auditory context signifies a long and prolonged sound from e.g. a wolf or a crying baby. These meanings can help us understand the music of duo Ry Cuming and Frank Wiedermann. Their compositions often begin with Cuming; an expressive and charismatic singer whose harsh vocal style aptly represents the group’s name. Meanwhile Wiedermann -one half of the fantastic me- produces delicate rhythmic and melodic structures, resulting in a magical surround sound similar to artists like Kiasmos, Tourist, Bob Moses or Junior Boys. They recently entered the prestigious and influential Resident Advisor list for best live shows 2015, which bodes well for their concert in SonarHall which will also feature subtle but effective lighting design created by the influential dutch studio Children of the Light.\r\n\r\nOriginally from Australia and resident in Los Angeles, Cuming has also produced under the name Rye X, and is known as the leader of synthetic folk band The Acid , with whom he has recorded several EPs and the album \"Liminal\". Meanwhile, Wiedermann enjoys a rock-solid reputation thanks to his long career with me and his work as head of Innervisions, exploring the intersections between the most elegant electronica and melodic pop. Under the Howling moniker, the two have found the perfect outlet for their respective talents, and since their very first release entitled, \"Howling\" -while still using their own names- the duo immediately earned the support of an expectant public by delivering their beautiful compositions. Their first album, \"Sacred Ground\" (Monkeytown, 2015), was a further proof of quality and will form the basis for their live debut at Sónar."},
{"name": "Ilia Mayer", "links": ["https://soundcloud.com/iliamayer", "https://disboot.bandcamp.com/album/vida-nocturna-2"], "title": "The sound of the universe", "country": "Disboot /  ES", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "13:00 - 14:00", "link": "https://sonar.es/en/2016/artists/ilia-mayer", "day": "Friday 17", "description": "Producer, composer and illustrator, Ilia Mayer has been operating on the fringes of the Barcelona electronic scene for some time, always working at his own pace and choosing not to succumb to the dictates of the market or the increasing speed of modern life. For this reason, despite his considerable experience, his debut only saw the light of day a few months ago. \"Vida Nocturna\" is comprised of just two tracks, but their working parts contain much more than the deluge of records released week after week. To quote the album liner notes by poet Martí Sales \"On this Ilia Mayer record we find trains running through the night, empty and illuminated, as if in a film by Theo Angelopoulos from the Ghibli studio. And conversations between insects moving through vegetables in a secret garden.\" Twenty minutes of music that is a universe in itself, drawing on ambient, minimalism, dub, field recordings and landscape textures with huge evocative power. His live appearance at SonarVillage on Friday will also include animated images that illustrate the unique world of this Barcelona based producer.\r\n\r\nMayer is a cornerstone of the Disboot label, where in addition to his role as a composer and producer he has had a long career as a graphic artist. He has designed several of the label’s album covers, for example two installments of the Downliners Sekt trilogy, and numerous flyers for various parties and events. He also collaborated on the track, \"Kyuuka\", the label’s first release back in 2008. He was of course responsible for the \"Nocturnal\" cover artwork that echoes the peculiar andand complex world of its author."},
{"name": "Insanlar", "links": ["https://soundcloud.com/insanlar"], "title": "Turkish hypnosis", "country": "Aboov Plak /  TU", "venue": "Sónar by Day - SonarDôme", "hour": "19:50 - 20:50", "link": "https://sonar.es/en/2016/artists/insanlar", "day": "Thursday 16", "description": "Committed wax-collector Baris K got his grounding in hip hop breaks from over a decade of producing his own weekly shows on Istanbul’s Dinamo FM and Açık Radyo. Inspired by revolutionary Turkish rock icon Baris Manco, he then turned his crate-digging powers closer to home, and uncovered a treasure trove of spaced-out psych rock and hashish-stained disco. With supersized bass lines and popping guitars, held together with spacey echoes and Turkish woodwinds, Baris has cornered a dancefloor sound that’s all his own. Baris blurs the boundaries even further with his improvised folk band Insanlar, a collaboration with sax player Cem Yildiz and a rotating group of guest artists. The band’s first single “Kime Ne” has been causing dancefloor goosebumps with its mixture of hypnotic tones and slow-build rhythms, and inaugurated Baris’ own Aboov Plak imprint in 2013. Ricardo Villalobos supplied a memorable edit of the tune for Honest Jon’s last year."},
{"name": "Intergalactic Gary", "links": ["https://soundcloud.com/intergalactic_gary"], "title": "Cult DJ", "country": "NL", "venue": "Sónar by Night - SonarLab", "hour": "23:30 - 00:30", "link": "https://sonar.es/en/2016/artists/intergalactic-gary", "day": "Friday 17", "description": "Voluntarily shying away from the trappings of fame, the Dutchman Intergalactic Gary has for some time been a cult DJ on the club and independent festival circuit throughout Europe. His formative years as a DJ began in the 80s in The Hague, where he was inspired by the innovative disco and Italo disco of that time. Naturally, thirty years of experience have given him a deep understanding of his profession, a virtue that is palpable in each of his sets, which are often lessons in electronic music history but never lose sight of the principal objective of all good DJs: to connect with the public, making them dance and experience pleasure through music. This is exactly what the Wellington, New Zealand born Dutchman does, and is why he is considered a favourite among other better known DJs.\r\n\r\nThe majority of Intergalactic Gary’s career has taken place at small parties and clubs in Holland. In the 90s he was a resident at The Hague’s most important club, The D.S., where every Sunday he handpicked the very best in Chicago house, disco, Belgian new beat, and dark techno with a special soft spot for Detroit. In his accomplished hands genres are blurred in a hypnotic and totally coherent manner, perfect for medium capacity clubs and audiences willing to be taken on long musical voyages. Besides his role as a DJ, Scheffer has been a radio presenter and has released his own material under the aliases Silverstream and The Paralaxx Corporation, the latter project in conjunction with another Dutchman of international standing, IF, with whom he shared considerable success between 2000 and 2001. For several years he has regularly performed on the European circuit at clubs like Panorama Bar in Berlin, and has released several mixes for labels including Dekmantel, Roller Disco Records and Digital Tsunami."},
{"name": "Ison", "links": ["https://soundcloud.com/ison-non"], "title": "Today’s Greek Electronica", "country": "GR", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "14:00 - 16:00", "link": "https://sonar.es/en/2016/artists/ison", "day": "Saturday 18", "description": "Behind Ison lies Anastasios Diolatzis, one of the Greek music scene’s busiest ambassadors. Diolatzis will take over the dj booth at SonarVillage transforming himself into Ison, sharing a special set that will showcase essential tracks from today’s Greek scene, while also not forgetting its past pioneers. A record collector and expert in the history of cutting edge Hellenic music, there is no one better to promote today’s budding Greek scene, with an exciting mix of Mediterranean foundations and fully contemporary sounds.\r\n\r\nDiolatzis list of job titles is a little dizzying: dj, producer, radio presenter (the area in which he began his musical journey and continues to this day), event coordinator, concert promoter, founder of Non- Collective, and the man responsible for one of country’s most important festivals, Reworks in Thessalonika, launched in 2005. His musical passion sees no boundaries, and has lately seen him focus on his role as producer, as well as working with the band Actor One, both projects touching upon every imaginable facet of electronica."},
{"name": "Ivy Lab", "links": ["https://soundcloud.com/ivylab"], "title": "Bass trio", "country": "20/20 LDN /  UK", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "17:00 - 18:15", "link": "https://sonar.es/en/2016/artists/ivy-lab", "day": "Saturday 18", "description": "The three members of Ivy Lab have drum'n'bass at the heart of their musical culture. In fact, Stray, Sabre and Halogenix were each working as solo artists at the fringes of the genre, before joining forces on a project that has proved to be much greater than the sum of its parts. Their shared synergy has helped create music that continues to draw from jungle and drum'n'bass syncopations but that also sits comfortably alongside bass music, abstract hip-hop and \"soulful\" electronica, regularly embracing the power of the groove. This was perfectly embodied in the group’s first album \"20/20\", an evocative and exuberant workout of rhythms, tones and melodies, that effortlessly combined relentless energy and a deftness of touch.The album also appears on their own newly created label 20/20LDN.\r\n\r\nThe collaboration between Stray, Sabre and Halogenix first took shape on single \"Oblique\", released in February 2012 on London label Critical Recordings. What was intended as a one off project, quickly consolidated into a diverse and ever expanding output, with a working method that leaves room for each member’s own creativity, in the form of a group or collective of producers operating individually but working under the same name. Following several singles on Critical -as well as appearances on other labels including Goldie’s legendary Metalheadz and Shogun Audio- they started the 20/20 parties in London and founded their own label, thereby creating a channel for their output of wide ranging sounds including footwork, jungle, drum'n'bass, hip-hop and future beats."},
{"name": "Jackmaster", "links": ["https://soundcloud.com/jackmaster"], "title": "Superstar DJ", "country": "UK", "venue": "Sónar by Night - SonarPub", "hour": "05:00 - 07:00", "link": "https://sonar.es/en/2016/artists/jackmaster", "day": "Saturday 18", "description": "In the five years that have passed since his last Sónar performance, Jack Revill has established himself as one of the finest and most admired dj’s in the world. A product of the underground, his independent spirit remains intact, while he is equally at home sharing centre stage with the likes of Jamie Jones and Seth Troxler in Ibiza. His lack of musical prejudice, an open-minded approach and ability to adapt to any given situation are just some of the reasons why year after year he has retained his popularity with the masses. An equally important factor is his wide-ranging taste, and ability to surprise: something that makes it impossible to know for certain which musical direction his sets will take. It is also worth pointing out that Jackmaster is one of a handful of djs on the international scene who has remained at the top without the need to produce or remix, relying almost exclusively on his innate skills and talent on the decks to thrive.\r\n\r\nJackmaster has been obsessed with music ever since his early years working at the legendary record store Rubadub in his native Glasgow, a place he continues to cite as the source and starting point for his unmatched sound. Self confessed super fan of Prince and dedicated collector of disco and funk gems and rarities, Revill was involved in collectives and labels like Dress 2 Sweat and Wireblock before founding Numbers with his friend Spencer. The label has released material, SBTRKT, Deadboy, Redinho, Jessie Ware, Sophie, Jamie xx and Mosca among many others. Since the very beginning his sets have been a object lesson in versatility and imagination; as can be seen on the now infamous mix series ‘Tweak-A-Holic’, his many contributions to websites, clubs and benchmark music platforms (Essential Mix, Fact, Resident Advisor, Fabric) and, of course, countless sets at festivals around the world. No other dj combines passion, knowledge, energy, honesty and humour better than Jackmaster."},
{"name": "JackWasFaster", "links": ["http://www.soundcloud.com/jackwasfaster"], "title": "Eclectic hardware", "country": "Rotten City /  ES", "venue": "Sónar by Day - SonarDôme", "hour": "13:50 - 14:40", "link": "https://sonar.es/en/2016/artists/jackwasfaster", "day": "Friday 17", "description": "JackWasFaster is the name chosen by Madrid based producer Manuel Cachero (guitar, synth and electronics of Spanish well known indie-electronic band Fira Fem) for his solo project. His tracks and remixes search for the common ground between synth driven electronics, dark disco, dreamy post rock, obscure balearic, raw house or Weatherall´s post punk vibes. His first remixes (Fira Fem, Role, Nimio) got him to be part of Madrid 2015 edition of RedBull Music Academy Bass Camp. After that, he starts releasing for labels like Envy, Bucketround or Voyeur Music and his main home, Rotten City, ruled by Álvaro Cabana. His hardware-based live set is his main weapon, receiving great reviews after playing at festivals like ArteNou and VillaManuela and big clubs like Mondo, Razzmatazz or Siroco."},
{"name": "Jacob Korn", "links": ["https://soundcloud.com/jacob-korn"], "title": "German touch", "country": "Uncanny Valley /  DE", "venue": "Sónar by Day - SonarDôme", "hour": "18:10 - 19:00", "link": "https://sonar.es/en/2016/artists/jacob-korn", "day": "Friday 17", "description": "Alongside his actual profession on the interface of audio, visual and dance, Jacob Korn has also been producing electronic music for what seems like an eternity. Early on in his career, the 2007 Academy alum combined hip hop and techno with elements of jazz and weird electronics under the moniker of Granufunk. Under his given name, Korn is now focussing predominantly on classic but versatile techno and house. After releases on labels such as Running Back, Skylax or Permanent Vacation, Steffi’s Dolly Label, and Dresden powerhouse Uncanny Valley, his name has become one of the most celebrated on the current German house circuit."},
{"name": "James Blake", "links": ["http://jamesblakemusic.com/", "https://soundcloud.com/byjamesblake"], "title": "New record, new show", "country": "UK", "venue": "Sónar by Night - SonarClub", "hour": "01:00 - 02:10", "link": "https://sonar.es/en/2016/artists/james-blake", "day": "Friday 17", "description": "After speculations about dates and titles, James Blake has dropped his third album, “The Colour In Anything”. The record -previously rumoured to be titled Radio Silence (the title of the opening track)- features two very special guest collaborators: Frank Ocean and Bon Iver's Justin Vernon. More high profile collaborations come in the form of infamous US producer Rick Rubin -who produced several tracks on the record- and Roald Dahl illustrator Sir Quentin Blake, who designed the artwork. Blake will perform his new songs at Sónar By Night live, an area in which the London musician feels especially at home, and where his stunning music becomes even more powerful. \r\n\r\nArtists like Blake are a rare occurrence. At just 22 years old he released the visionary and era defining EP \"CMYK\", and at 23 his first album, \"James Blake\", earned unanimous praise and proved a worldwide success. His first two albums revealed the building blocks and constants of his sound, namely; crisp production, mastery of bass frequencies, the combination of organic and digital elements, his natural talent on the piano and his mesmerising vocals. These attributes were amply demonstrated on his second - for some, even better - album \"Overgrown\", which deservedly won the Mercury Music Prize and led to a Grammy Nomination for Best New Artist. With his star fixed, Blake has recently been sharing new material in anticipation of his new album, both online and as part of his concerts. For example: a version of \"The Sound of Silence\" by Simon and Garfunkel, a BBC Radio1 residency, and a live broadcast where he played part of a song from his new album (its title track) mixed with a Bill Withers cover version."},
{"name": "James Rhodes", "links": ["https://soundcloud.com/jrhodespianist"], "title": "Music saves lives", "country": "UK", "venue": "Sónar by Day - SonarComplex", "hour": "18:30 - 19:30", "link": "https://sonar.es/en/2016/artists/james-rhodes", "day": "Thursday 16", "description": "\"In my concerts I talk about the pieces I play, I explain why I have chosen each, how important they are to me and the context in which they where composed.\" This is how James Rhodes explains his performances in the preface to his book \"Instrumental”, A Memoir of Madness, Medication and Music\", for which he has earned a huge and unexpected worldwide success. Besides playing, and placing in context, pieces by Bach, Rachmaninov, Schubert and Beethoven, the British pianist also tells the story of his life (abuse, addictions and asylums) and how music has helped him overcome the many severe obstacles in his life.\r\n\r\nRhodes is a classical music lover, to the point where he begins \"Instrumental\" with the phrase \"Classical music turns me on\". Charismatic, visceral and very talented, Rhodes says Bach (and specifically \"The Goldberg Variations\") saved his life, and he is not exaggerating. At 40 years old he has become a leading figure in popularizing classical music worldwide, thanks to tours and concerts at all kinds of festivals and venues, as well as various British TV documentaries filmed with his approval. His presence at Sónar by Day is irrefutable evidence that, effectively, music can heal."},
{"name": "Jamie Woon", "links": ["https://soundcloud.com/woon"], "title": "Contemporary crooner", "country": "PMR Records /  UK", "venue": "Sónar by Day - SonarDôme", "hour": "18:40 - 19:40", "link": "https://sonar.es/en/2016/artists/jamie-woon", "day": "Thursday 16", "description": "2008 Red Bull Music Academy alumnus Jamie Woon first rose to prominence as a definitive voice of the post-dubstep generation, having collaborated with Burial on his acclaimed 2010 underground hit “Night Air” and later signing to Polydor for his debut LP Mirrorwriting. With a celestial voice, exceptional songwriting skills and a knack for utilizing folky textures within ethereal electronic pop, Woon has an unparalleled talent for remaking the familiar in his own unique image. It’s been an active few years since for the modern-day troubadour, with Woon guesting on Disclosure’s “January,” collaborating with Portico and releasing his second LP Making Time in late 2015 via PMR."},
{"name": "Jean-Michel Jarre", "links": ["http://jeanmicheljarre.com/", "https://soundcloud.com/jeanmicheljarre"], "title": "The Godfather of Electronic Music", "country": "FR", "venue": "Sónar by Night - SonarClub", "hour": "22:30 - 00:00", "link": "https://sonar.es/en/2016/artists/jean-michel-jarre", "day": "Friday 17", "description": "A pioneer and a titan of electronic music since his groundbreaking debut album Oxygene, the French producer, musician and composer Jean-Michel Jarre recently released his new project, “Electronica”, in two parts. Vol.1, “The Time Machine\", was released at the end of 2015, with the collaboration of artists such as Vince Clarke, John Carpenter, Boys Noize, Robert \"3D\" Del Naja (de Massive Attack), Air, M83, Fuck Buttons and Laurie Anderson, among others. The following volume, named “The Heart Of Noise”, appeared this Spring and saw Jarre working with Pet Shop Boys, Gary Numan, Peaches, The Orb, Siriusmo, Julia Holter and even Edward Snowden. This two albums will form the core of his new highly anticipated live show, the world premiere of which will take place at Sonar by Night on Friday June 16th.\r\n\r\nJean-Michel Jarre’s successful career spans over four decades. Seminal albums “Oxygene” and “Equinoxe” are widely considered to be fundamental works in popular electronic music, a first reference in many households for the genre, and an inspiration for many of the next generation of tech savvy musicians and producers. Another of his great contributions to electronic music has been his visionary live shows, always imagined as sensory and technological experiences of colossal proportions, designed on city scale. Up to one million people attended shows in Paris and Houston and Jarre also performed in front of Guinness-World Breaking audience of 3.5 million live in Moscow. It can be said that over 30 years ago, Jarre was the first to invent and create the multimedia concert experience as we know it today, mapping buildings of cities around the world before anyone, lighting the skies with beams and pyrotechnics, offering his audience the ultimate, total immersion, sound and vision experience, which today is the ambition of every international festival."},
{"name": "John Grant", "links": ["http://johngrantmusic.com/"], "title": "Pure class", "country": "Bella Union /  US", "venue": "Sónar by Day - SonarHall", "hour": "20:30 - 21:30", "link": "https://sonar.es/en/2016/artists/john-grant", "day": "Friday 17", "description": "John Grant will perform for the first time at Sónar and present his new album \"Grey Tickles, Black Pressure\". The album once again demonstrates that Grant is one of the most sophisticated composers and performers around today. And also the most versatile: the man from Michigan is more than adept at moving between mid-paced pop, classical instrumentation and a refined aesthetic, to soaring electro glam, with all the elements sitting together as if it were the most normal thing in the world. Increasingly free from the chains of traditional structure and pre-established patterns, his new songs are more modern and visceral than ever without losing any of his long established musical identity. Grant is like Benjamin Button: the more the years pass by, the younger he appears to be.\r\n\r\nThis state of lucidity and understanding is not achieved overnight. Grant headed indie rock band The Czars for 10 years, where he amply demonstrated his compositional skills. After the group disbanded Grant took a few years to rest and reflect before finally releasing his solo debut, \"Queen of Denmark\" in 2010, a powerful album exposing his demons (his sexual orientation, for example) and addictions (alcohol, drugs). His second album followed (\"Pale Green Ghosts\"), along with a new life in Iceland, awards and recognition from both the broadsheet press and the music industry. He collaborated with the BBC Philharmonic Orchestra as well as Hercules and Love Affair (where he began to show his adventurous side as a solo artist) and very personal covers of Elton John and Lee Hazlewood (the latter alongside Alison Goldfrapp), featuring on both their respective albums."},
{"name": "John Grvy", "links": ["http://www.soundcloud.com/johngrvy"], "title": "Synth soul charisma", "country": "ES", "venue": "Sónar by Day - SonarDôme", "hour": "15:25 - 16:15", "link": "https://sonar.es/en/2016/artists/john-grvy", "day": "Thursday 16", "description": "John Grvy is the electronic project of the young Madrid-born singer J.E.Edward. He easily and gently moves around chillwave, new wave R&B and electronic neosoul. Think in a transmutation of Hudson Mohawke, Frank Ocean or James Blake coming into one figure. Despite his youth, his self-confidence on stage and his great band are powerful enough to showcase an impressive show, seen in several festivals and venues across the county. After a couple of EPs, he’s releasing his first album in 2016 at the Red Bull Studios network. Definitely, a young promise to look at."},
{"name": "John Luther Adams + Barcelona Symphony Orchestra", "links": ["http://johnlutheradams.net", "http://www.auditori.cat"], "title": "Sónar and L’Auditori", "country": "US-ES", "venue": "Sónar by Day - L'Auditori", "hour": "20:30 - 21:15", "link": "https://sonar.es/en/2016/artists/john-luther-adams-barcelona-symphony-orchestra", "day": "Thursday 16", "description": "Sónar and Barcelona’s Auditori reignite their collaboration to jointly present \"Become Ocean\", an orchestral composition by John Luther Adams directed by Brad Lubman and performed by the Barcelona and Catalonia National Symphony Orchestra (OBC).\r\n\r\n\"Become Ocean\" positions itself halfway between symphony and contemporary ambient, moving the aesthetic and sound of electronic drones, to a symphonic orchestral language. The 42-minute piece is inspired by the mass of the Pacific Ocean and warns us about the progressive melting of the Arctic as a result of global warming. \"Become Ocean\" was awarded the Pulitzer Prize for Music in 2014 and the Grammy for Best Contemporary Composition in 2015 and has been heralded as a work destined to break new ground for symphonic writing in the XXI century. Renowned New Yorker critic Alex Ross -author of \"The Eternal Noise\"- defined the piece thus: \"It may be the loveliest apocalypse in musical history.\"\r\n\r\nBorn in 1953 in Mississippi, and an Alaskan resident since 1978, John Luther Adams is one of the most prestigious American composers of recent times. His career is closely linked to the environmental movement, and his most important works often introduce electronic elements intended to warn against the dangers man’s destruction of the natural habitat. He has won numerous awards including the William Schuman Award from Columbia University for the profound significance and global scope of his work. He has taught at Harvard and several of the most important music conservatories in the United States and has spent several years working actively with the Anchorage Opera and Symphony Orchestra in Alaska."},
{"name": "John Talabot", "links": ["https://soundcloud.com/john-talabot"], "title": "Closing Friday in style", "country": "Hivern /  ES", "venue": "Sónar by Night - SonarPub", "hour": "05:00 - 07:00", "link": "https://sonar.es/en/2016/artists/john-talabot", "day": "Friday 17", "description": "Talabot returns to Sónar having -on his own merits- become one of the leading and most revered names on the international scene. The Barcelona dj and producer will be handed the task of closing Friday night at the SónarPub stage, where he will play one of his transcendental sets, mixing exquisite house while delving into cosmic disco, deep techno or various manifestations of bass music. He is currently working on his long-awaited second album, and just recently completed two remixes of \"Loud Places\", a song from the latest album by label mate Jamie xx. Talabot will take a break from the studio to close proceedings on Friday at Sónar by Night.\r\n\r\nSpain’s foremost producer of electronica has now made the jump to the world's major leagues. John Talabot (Oriol Riverola on his passport) first began to establish his much deserved reputation with two singles on Permanent Vacation, \"My Old School\" and \"Sunshine\" in 2009. By this time Oriol had already gained considerable experience in the Barcelona club under his former alias, D.A.R.Y.L.; he then released singles on Young Turks and, of course, received huge recognition for his fantastic debut album, \"ƒin\" (Permanent Vacation, 2012). Talabot’s sensitivity and feel are especially evident in his work as head of Hivern Discs, the impeccable label whose catalogue is helping define the very best in contemporary European house music. He recently formed duo Talaboman together with Sweden’s Axel Boman, and has actively decided to reduce his number of concerts and dj sets, in order to devote more time to his studio production and to writing new compositions for his second album. Yet another reason to celebrate the presence of this superstar at Sónar 2016."},
{"name": "Kasper Marott", "links": ["https://soundcloud.com/kaspermarott"], "title": "Rhythms & textures", "country": "Oscillat Music /  DK", "venue": "Sónar by Day - SonarDôme", "hour": "16:20 - 17:20", "link": "https://sonar.es/en/2016/artists/kasper-marott", "day": "Thursday 16", "description": "Kasper Marott spends his days crafting both sprawling, improvised ambient soundscapes and propulsive techno thumps. He finds a similarly sprawling space in both styles, bouncing rhythms and textures alike through his weapon of choice, a Korg Stage Echo. This stylistic breadth is informed by a musical curiosity – the Danish producer scans the radio airwaves and deep mines the Discogs archives for new tunes. His debut EP was released on Horse On Horse in 2014."},
{"name": "Kaytranada", "links": ["http://kaytranada.com/", "https://soundcloud.com/kaytranada"], "title": "Silken Beats", "country": "XL Recordings /  CA", "venue": "Sónar by Night - SonarPub", "hour": "00:20 - 01:20", "link": "https://sonar.es/en/2016/artists/kaytranada", "day": "Saturday 18", "description": "With rhythms and beats that would turn even the mighty J Dilla green with envy, an exquisite soulful touch for melodies, and a healthy dose of funk in his bass lines, Kaytranada is one of today's best producers, working in a broad sound spectrum including house, hip-hop, R&B and funk, the four integral elements of his style. '99.9%', his new album, featuring collaborations from BadBadNotGood, Syd Tha Kid, Karriem Riggins, Anderson .Paak y Little Dragon among others, is a further testament to his talent; as will be his performance on Sat June 18th at Sónar by Night, directly after Santigold.\r\n\r\nIf his first visit to the festival in 2014 signified his emergence as a beatmaker of the future, he is now a fully fledged producer, who has lent his innate talent and skills to singers and artists including Rome Fortune, Katy B, Craig David, The Internet, Freddie Gibbs and Talib Kweli and many others. Kaytranada (Kevin Celestin) was born in Haiti and raised in Montreal. In his teens he absorbed everything related to hip-hop and R&B culture, to the extent that between the age of 15 to 17 he was successfully-producing at least one beat per day. It was not long before his mix tapes and edits (Missy Elliot, Janet Jackson, TLC or Danny Brown among others) drew attention from labels like Bromance, HW&W and Jakarta, on which he has released some of his excellent material."},
{"name": "Kelela", "links": ["https://soundcloud.com/kelelam"], "title": "Rising star", "country": "Warp /  US", "venue": "Sónar by Day - SonarHall", "hour": "19:00 - 20:00", "link": "https://sonar.es/en/2016/artists/kelela", "day": "Thursday 16", "description": "Part of a new and very exciting breed of r&b singers (Abra, Alexandria, Dawn Richard, etc.) Kelela is noted for her versatility and ability to adapt to contemporary mainstream electronica. In 2013 her debut \"Cut 4 Me\" took the world by storm and was featured on numerous best of year lists. Her latest EP \"Hallucinogen\" (released on Warp) demonstrates her unique talent as an ever-evolving artist on the rise. Everything about her is special: her name (last name Mizanekristos) of Ethiopian origin; her stunning beauty; her incredibly versatile voice; her eye-catching videos and the unparalleled magnetism of her stage presence. Even more special are the six songs on \"Hallucinogen\", lyrically stark and sincere with futuristic and captivating production techniques, featuring participation from Ark, Daniel Pineda, Kingdom and Nguzunguzu among others.\r\n\r\nKelela was born in Washington DC and began her musical career as part of the house duo Teengirl Fantasy. However her big break came thanks to the Fade To Mind family, sister label of the British Night Slugs imprint. A number of artists from the two highly regarded labels (Bok Bok, Nguzunguzu, Girl Unit, Kingdom and Jam City, among others) collaborated on her debut release, \"Cut 4 Me\", providing killer beats and futuristic bass lines, perfect for showcasing her considerable vocal skills. The album received plaudits from none other than Björk, and also received rave reviews across America and Europe. Following the album came collaborations with Kindness, Obey City and Future Brown; her signing to Warp; and the release of the extraordinary \"Hallucinogen\". Kelela moves with considerable ease between mutant soul, cutting edge beats and contemporary r&b, and has already established herself as one of the most important singers of her generation. Justifiably."},
{"name": "Kenny Dope", "links": ["https://soundcloud.com/kenny-dope"], "title": "Master at Work", "country": "US", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "21:00 - 23:00", "link": "https://sonar.es/en/2016/artists/kenny-dope", "day": "Thursday 16", "description": "Following the distinguished line of memorable closures at Sónar by Day by the likes of Dj Harvey and Theo Parrish, Sónar 2016 will see another illustrious dj grace the Village stage, whose experience and knowledge are unparalleled: Kenny Dope Gonzalez. The NYC dj is a luminary of the house, garage and original hip hop scene, both as a solo artist and member of the legendary duo Masters At Work with partner Little Louie Vega. Dope is a past master (pun intended) of mixing soulful sounds, phat hip-hop beats and Latin rhythms for the dance-floor, and is responsible for countless hits that are cornerstones in the history of house music. His set on Thursday at SónarVillage promises to provide an endless selection of rare treats from all eras and styles, and is an absolute must for all lovers of dance music (and music in general).\r\n\r\nBorn into a Puerto Rican family, the life of Kenny Gonzalez has always been connected to music. From a very young age his first love was hip-hop, which has always remained a key element in his work. Aged 15 he was already organizing parties in Brooklyn under the Masters At Work name (at that time with Mike Delgado, with Todd Terry regularly attending). Shortly after he joined forces with Vega and in 1990 they began to release their first productions together. The rest as they say is history: immortal garage and house hymns, widespread recognition and respect, hugely important parallel projects (Nuyorican Soul, The Bucketheads) and collaborations with Robert Owens, Tito Puente and Jocelyn Brown have gone on to form an incredible recording legacy and discography that continues to grow today."},
{"name": "Kerri Chandler", "links": ["http://www.kerrichandler.com", "https://soundcloud.com/kerri-chandler"], "title": "House spirit", "country": "US", "venue": "Sónar by Night - SonarLab", "hour": "01:30 - 03:00", "link": "https://sonar.es/en/2016/artists/kerri-chandler", "day": "Friday 17", "description": "Friday night at SonarLab will feature deep house music luminary: Kerri Chandler, one of the genre’s most respected names and a legend on the American underground scene. Chandler’s musical background can be traced back to listening to many hours of jazz with his father (a DJ like him) during his childhood and adolescence in his native New Jersey, and of course, via the house and garage scene in neighbouring New York City. This heritage is essential to his sound and is clearly evident in both his productions and DJ sets, which always carry a deep spiritual message. Chandler’s house sound leans more towards Africa than Chicago with: more soul than ghetto, more jazz than electro, and more funk than techno. That said, Chandler is open minded to a fault and his sets are mixed with an astonishing fluidity, incorporating both cutting edge and classic tracks, without ever losing the warmth and human energy of the dance floor.\r\n\r\nChandler has remained true to his vision of living and understanding music since his first singles saw the light in the early 90's. He is a man of strong religious beliefs, whilst simultaneously fascinated by the new possibilities offered by technology. The American DJ and producer has founded several labels (Madhouse and Madtech Records, among others) and is said to have released more than 100 albums during his 25-year career. He recently shared some of his older tracks online (\"Get it Off\", released under the moniker Three Generations, and the long player “Into The Night”, which remains unreleased). He continues to DJ and plays at clubs and events around the world. It is an honour to have him perform at this year's festival."},
{"name": "King Midas Sound + Fennesz", "links": ["http://soundcloud.com/kingmidassound"], "title": "Strength in numbers", "country": "Ninja Tune /  UK", "venue": "Sónar by Day - SonarHall", "hour": "17:30 - 18:30", "link": "https://sonar.es/en/2016/artists/king-midas-sound-fennesz", "day": "Thursday 16", "description": "Kevin Martin and Christian Fennesz are both incredibly well respected musicians on the international scene -one being based in London, the other in Vienna- who recently combined forces to produce work that moves beyond the sum of their individual talents. On first glance they appear to have little in common, however upon hearing \"Edition 1\" the similarities become more obvious, especially their shared passion for musical risk taking and their zeal for sonic exploration and unconventional sounds. In this happy partnership Fennesz provides his own style of distorted guitar textures while Martin adapts them to a more typically placid place, to which two final ingredients are added: vocalists Roger Robinson and Kiki Hitomi, both accomplices of Martin in King Midas Sound. The four performers -Martin, Robinson, Hitome and Fennesz- will take to the SónarHall stage for a concert that is sure please the most open minded and demanding eardrums.\r\n\r\nKevin Martin is the mind behind integral projects in the field of experimental dub including Techno-Animal and The Bug. He also created King Midas Sound in 2007 together with Robinson to provide an outlet for the more lyrical and reflective side of their music projects. To date they have released several singles and an album, \"Waiting For You\" on Kode9’s label Hyperdub. Meanwhile, Christian Fennesz has already spent almost two decades experimenting with beautiful and often unsettling soundscapes, replete with feedback and processed guitars. Their output is some of the most important work in ambient and avant-garde music in recent years and includes \"Hotel Parallel\", \"Endless Summer\", \"Venice\" and more recently \"Bécs\". \"Edition 1\" represents the first in a series of four albums planned by King Midas Sound and will see them work alongside musicians they have always admired, with Fennesz of course being at the top of the list."},
{"name": "Kode9", "links": ["https://soundcloud.com/kodenine"], "title": "HyperDJ", "country": "Hyperdub /  UK", "venue": "Sónar by Night - SonarClub", "hour": "00:05 - 00:55", "link": "https://sonar.es/en/2016/artists/kode9", "day": "Friday 17", "description": "Even before creating the fundamental British electronic music label Hyperdub in 2004, Steve Goodman had taken his first artistic steps as Kode9, playing at some of the most emblematic clubs in South London (including the legendary FWD>). Since then he has continued to dj and is considered to be a true master of the art. His sets often journey through various hardcore continuum styles: jungle, dubstep, UK funky, garage, grime, and in more recent years adding a large helping of footwork, the genre which he has helped popularize throughout Europe through his sets as well as several Hyperdub releases. This year at Sónar he will provide two very different performances: firstly he will present \"Nothing\" live, with stage design by Lawrence Lek, returning for a DJ set on Friday 17th at Sónar by Night, providing the perfect sonic bridge between the concerts of Jean-Michel Jarre and James Blake.\r\n\r\nSteve Goodman is perhaps the most important figure in the UK bass music scene: an extraordinary DJ; founder of the Hyperdub label (which has released, among many others: Hype Williams, Laurel Halo, Cooly G, King Midas Sound, Zomby, Dj Rashad and Darkstar); and a producer with an impressive discography including three LPs: \"Memories of the Future\" (2006), \"Black Sun\" (2011) (both with the late singer Spaceape) and \"Nothing\" released in 2015. He is also the author of the \"Sonic Warfare\", a book about the effect of noise in urban sound environments."},
{"name": "Kode9 x Lawrence Lek present The Nøtel", "links": ["https://soundcloud.com/kodenine", "http://lawrencelek.com/"], "title": "The first live appearance from the Godfather of bass", "country": "Hyperdub /  UK", "venue": "Sónar by Day - SonarHall", "hour": "17:30 - 18:30", "link": "https://sonar.es/en/2016/artists/kode9-x-lawrence-lek-present-the-notel", "day": "Friday 17", "description": "Following his recently released third album \"Nothing\" as Kode9 (and the first without The Spaceape), Britain's Steve Goodman will perform live at Sónar with a new audiovisual show created by the German artist Lawrence Lek. The show is based on an evacuated fully automated luxurious hotel called Notel, whose logo appears on the front cover of the album: the rooms and corridors of this phantasmagorical and mesmerizing stage design will act as the platform for the London producer to develop his new compositions, masterfully moving between the most cutting edge terrain of grime, footwork, dubstep and music from B-list movies.\r\n\r\nSteve Goodman is perhaps the most important figure of the UK bass music scene: dj extraordinaire, original resident of the legendary FWD>> club, founder of label Hyperdub (where he has released material by Hype Williams, Laurel Halo, Cooly G, King Midas Sound, Zomby, Darkstar or Dj Rashad, among others) and author of the philosophical Sound Affect and the Ecology of Fear book \"Sonic Warfare\". The evolution of the British hardcore continuum would not be the same without him. His youthful collaborator Lawrence Lek (born in Frankfurt and a London resident) defines himself as a simulation artist, a creator of ambiguous spaces and sensory experiences such as holograms, volatile sculptures and gravity defying scenery."},
{"name": "Kölsch (live)", "links": ["https://soundcloud.com/kolsch"], "title": "Irrepressible Techno", "country": "Kompakt /  DK", "venue": "Sónar by Night - SonarPub", "hour": "03:55 - 04:55", "link": "https://sonar.es/en/2016/artists/kolsch-live", "day": "Friday 17", "description": "Widely admired and respected by the house and techno community, Rune Reilly Kölsch (half Danish, half Irish) has spent many years producing high quality material and injecting energy (and melody) into the continent’s finest dance floors. An integral member of Michael Mayer’s Kompakt label, Kölsch has released several singles and EPs (almost all as part of the Speicher series) and two deeply emotionally charged albums: the dynamic and varied \"1977\", in which Rune openly explores his relationship with his hippie parents and his childhood in a Christian commune; its sequel, \"1983\" was released in June last year, and once again proved to be a record made from the heart, inspired by a trip to Europe when he was just six years old. His LP material is more personal and intimate than his powerful techno sets and markedly different from his studio tracks made with one eye on the dance floor. Kölsch will demonstrate each of these facets in a new semi exclusive, visually enhanced live show at SonarPub, one of his rare performances this summer."},
{"name": "Krysko & Greg Lord", "links": ["https://soundcloud.com/krysko", "https://soundcloud.com/greglord"], "title": "Mancunian idols", "country": "UK", "venue": "Sónar by Night - SonarLab", "hour": "02:50 - 04:00", "link": "https://sonar.es/en/2016/artists/krysko-greg-lord", "day": "Saturday 18", "description": "The 2016 collaboration between Sónar and Manchester club The Warehouse Project would not be complete without two resident DJs, Krysko & Greg Lord. Both DJs are heroes of their city's nightlife and are well known in the wider British club scene. They will offer one of their accomplished sets at SonarLab on Saturday night, sharing the stage with leading artists including Ben Klock, Stormzy and Bicep. Both refuse to define their style: preferring to let the music do the talking. Their sets are open to potentially any sound and rhythm conceivable and are replete with variety and imaginative mixes. Their masterly touch clearly demonstrates the years of experience they have accumulated behind the decks.\r\n\r\nKrysko is the oldest resident of the Manchester club. He has previously recorded two mixes for the BBC Radio 1 Essential Mix series and is a regular fixture in line-ups for the best clubs and festivals in the UK and America. He has also released a couple of EPs on labels like Peaches (Chicago) and Whatever. Much like his regular accomplice in the DJ booth, Greg Lord has also played at many of the most popular festivals in UK and has increasingly played in the clubs of Ibiza, where he debuted at none other than Space."},
{"name": "Lady Leshurr", "links": ["http://www.lyeah.co.uk/", "https://soundcloud.com/ladyleshurr"], "title": "The new Queen speaks", "country": "Gutter Strut /  UK", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "18:00 - 18:30", "link": "https://sonar.es/en/2016/artists/lady-leshurr", "day": "Thursday 16", "description": "When a Youtube video reaches twenty million views it usually means something special. This is the number of plays achieved by Lady Leshurr’s \"Queens Speech # 4\" a video posted in July 2015. The latest video instalment “number 5” has already been viewed more than five million times (and rapidly counting) in just one month. The super fresh English MC has become a phenomenon with her rapid-fire freestyle raps fused with self produced grime and hip-hop in collaboration with newcomers like Show & Prove, Krunchie and Z Dot. The UK sound’s new queen will offer large doses of relentless rhymes (and beats) and remarkable charisma, on stage at SonarVillage. Haling from the Kingshurts suburb, ten minutes from Birmingham, Melesha O'Garro is blessed with amazing talent and knowledge. So far this decade she has already released nearly a dozen mixtapes and four EPs, has launched her own label (Gutter Strut), in record has achieved viral numbers on the web with her Queens Speech series (recently compiled on one disc) and has worked with various producers and artists (including Stormzy, and France's Mr. Flash from the Ed Banger stable). A few weeks ago she uploaded a rereading of Kanye West’s \"Real Friends\" to her Soundcloud account and at the end of 2015 she performed cover versions of classic songs by Sister Nancy, Missy Elliott, Drake and Eminem for BBC 1Xtra Live. One word to sum her up? Attitude."},
{"name": "Lafawndah", "links": ["https://soundcloud.com/lafawndah"], "title": "Global vision", "country": "Warp /  FR", "venue": "Sónar by Day - SonarDôme", "hour": "17:30 - 18:15", "link": "https://sonar.es/en/2016/artists/lafawndah", "day": "Saturday 18", "description": "Paris-based singer/producer Yasmine Dubois has been causing ripples worldwide with her futuristic take on globaltronica as Lafawndah. After packing in her job as a gallery curator in New York, the half-Iranian, half-Egyptian musician moved back to Paris to concentrate on honing her “ritual club music,” influenced by Nina Simone, Brandy, traditional Middle Eastern singers, dancehall queens and the Night Slugs label’s modernist take on grime and bass. For her self titled debut Lafawndah flew to Guadeloupe to work with Portuguese producer Garagem Banda, Emily King, and zouk veteran Jean Claude Bichara. A nod, perhaps, to Grace Jones, the result is what she calls “island life music,” a sensual synthesis of industrial, drone, ’80s electronic bands and tropical flourishes. Collaboration is where her heart lies, and she’s since worked with producers like L-Vis 1990, Bruno Coviello and Nick Weiss. Her ’Tan’ EP was released to much fanfare by Warp Records earlier this year."},
{"name": "Las Hermanas", "links": ["https://soundcloud.com/lashermanas", "http://www.lashermanas.bandcamp.com"], "title": "Photos of a Latin past revealed", "country": "CO", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "16:00 - 17:00", "link": "https://sonar.es/en/2016/artists/las-hermanas", "day": "Friday 17", "description": "After their fantastic performance at Sónar Bogotá, Sónar Barcelona welcomes Las Hermanas with open arms, one of Colombia’s most interesting projects so far this decade. Las Hermanas dust off old and melancholic sounds that evoke the romance and elegance of Latin American music, re-contextualizing by blending the past and future to perfection. They recently published \"Kulto of Kultos\" (2016), a new four track EP that reignites a seductive and unique sound. Their live show combines modern electronic beats with redefined samples of music heard by Colombian grandparents, all illustrated with ancient emotive sepia toned images, burned in timeimages, bearing the hallmarks of time.\r\n\r\nLas Hermanas is in fact the personal project of visual artist Diego Cuellar. His first two EPs, “Hermanas I” y “Hermanas II”, were released in 2014, to immediate critical acclaimand were immediately acknowledged, receiving both public and multiple specialized media acclaim in Latin America, both in the mainstream and specialized press: so much so that Las Hermanas were featured in the ‘best of year’ lists for Club Fonograma, Sounds and Colours, Noisey and Remezcla. His sound is unforgettable and inimitable, in that instead of exploring tropical themes or electronic club music, he retouches timeless relics, to map out a peaceful, serene and very cinematic atmosphere. It is now time for the European public to discover this fascinating artist and a performance that is like no other."},
{"name": "Laurent Garnier", "links": ["http://www.laurentgarnier.com", "https://soundcloud.com/laurent-garnier"], "title": "Garnier like you've never seen him before", "country": "FR", "venue": "Sónar by Night - SonarCar", "hour": "00:00 - 07:00", "link": "https://sonar.es/en/2016/artists/laurent-garnier", "day": "Saturday 18", "description": "Garnier will deliver a very special seven-hour set at this year’s Sónar. An unprecedented session in which a story is told through music, a counter-narrative to the frenesis of everyday life. Garnier’s next performance at Sónar by Night will add yet another chapter to the long standing relationship between the French dj and the festival; Garnier himself suggested the idea, choosing Sónar as the ideal environment to express his art form and take us on an expansive treasure laden musical journey. A unique opportunity to dust off old records, mix timeless classics and forgotten underground gems from start to finish, which is guaranteed to be an extraordinary experience both in his career and in the history of Sónar.\r\n\r\nA regular fixture at the festival since the very first Sónar in 1994, Garnier has played a crucial role in the development and recognition of electronic music as the popular sound of our times. Admired worldwide, always ambitious and in a permanent state of flux, the French dj and producer continues to regularly release first rate material including five EPs on five different labels during 2014 and 2015. Despite his long career (last year he celebrated his 25th anniversary as a dj) he has never once lost his total and unrelenting love for music or passion for his profession. He recently revived the F Communications label, on which he released the extensive compilation \"The Home Box\". This year, Saturday night at Sónar, the revamped SonarCar stage is all his."},
{"name": "Lemonick", "links": ["https://soundcloud.com/hellolemo"], "title": "Alpine grime", "country": "Clubwerks /  SW", "venue": "Sónar by Day - SonarDôme", "hour": "14:15 - 15:20", "link": "https://sonar.es/en/2016/artists/lemonick", "day": "Thursday 16", "description": "Lemonick is the project of half-Scottish, half-Swiss producer and DJ, Nicolas Baillie. Part of local Swiss crew Kartel Klub –a collective of nine DJs, producers and label owners that has held residencies at clubs throughout the country– he presents their monthly podcast Kartel Kast, as well as presenting a show on Swiss alternative radio station Couleur 3. Meanwhile, his productions –with their choked basslines, clobbering drums, and peppering of gunshot samples– reference up-to-the-minute UK dance music."},
{"name": "LiL JaBBA", "links": ["https://soundcloud.com/lil-jabba"], "title": "Volcanic Rhythms", "country": "Local Action /  US", "venue": "Sónar by Day - SonarDôme", "hour": "13:00 - 14:10", "link": "https://sonar.es/en/2016/artists/lil-jabba", "day": "Thursday 16", "description": "Brooklyn-residing producer LiL JaBBA was inspired to get into the studio by the late great DJ Rashad. The influence is still clear today in his rapid-fire sampling, but it’s the weird viscerality of LiL JaBBA that makes him stand out. After self-releasing tapes of his music in Baltimore, LiL JaBBA has since released on underground labels Local Action, True Panther and Watercolor, and contributed to a radical new kind of club music that speaks to what it’s like to grow up on the internet. In his own words, his new album, due in 2015, sounds like “garage that’s fallen into a bubbling, percolating volcano.”"},
{"name": "Lloret Salvatge", "links": ["https://soundcloud.com/lloret-salvatge", "http://famelic.com/grups/lloretsalvatge/"], "title": "Global Sonic Landscapes", "country": "Famélic /  ES", "venue": "Sónar by Day - SonarHall", "hour": "14:30 - 15:20", "link": "https://sonar.es/en/2016/artists/lloret-salvatge", "day": "Friday 17", "description": "Experimental electronica micro-compositions. These ara the words used to describe the work of Quim Font (the man behind Lloret Salvatge) by his label, Famèlic Records. This Catalan musician produces short sound pieces with long resonance, forging sampled sounds, field recordings (waves, hammers, rain) into ethereal atmospheres somewhere between ancient folk and cutting edge minimalism. This process shaped the work \"Humitats\", an album consisting of 30 micro-tracks less than 2 minutes in length that relate to his daily life. He will present these songs live on stage with a special AV show at SonarHall.\r\n\r\nThe narrative contained in \"Humitats\" reveals an author with much to share and whose talent would fit perfectly in the world of soundtracks. His unique and inimitable sound was first heard on the \"La Roqueta\" EP, released in late 2012 using a more song based format, which incorporated a mix of psychedelic folk with dreamlike noisy electronic sounds. Despite these lofty genre descriptions, the music of Lloret Salvatge is not at all pretentious or inaccessible. On the contrary, it captures subtle moments and tiny everyday situations, turning them into a wondrous collision of sounds that coalesce perfectly and naturally."},
{"name": "Magic Mountain High", "links": ["https://soundcloud.com/move-d/sets/magic-mountain-high"], "title": "Real synth live", "country": "Workshop-Off Minor Recordings /  IL-DE", "venue": "Sónar by Day - SonarDôme", "hour": "20:30 - 22:00", "link": "https://sonar.es/en/2016/artists/magic-mountain-high", "day": "Saturday 18", "description": "The trio of Move D and Juju & Jordash make up the improvising group Magic Mountain High. For each one of them, improvisation is more than just creating something on the spot: it informs their whole attitude to live performance and music making. In this day and age of pre-programmed laptop sets, Magic Mountain High aim to bring the moment back to the dancefloor, capturing the artistry back from convenience and giving the dancers something they can cherish. Stripping each set down to the bare essentials, the group use a changing combination of synths, drum machines and effects, and then perform on the fly, each time something different. After jamming at Move D’s studio, the trio really came together for good when both parties were asked to perform the soundtrack to 1920s cult film Der Golem. They decided to do it together and have been surprising themselves at various venues and festivals ever since."},
{"name": "Malard", "links": ["https://soundcloud.com/malard"], "title": "Imaginary universes", "country": "CO-ES", "venue": "Sónar by Day - SonarDôme", "hour": "13:00 - 13:45", "link": "https://sonar.es/en/2016/artists/malard", "day": "Saturday 18", "description": "Though he’s largely working within a freeform ambient structure, Sebastián De los Ríos pulls plenty of texture and emotion from layered drone. You might hear what sounds like a field recording of cars driving through puddles, or crunchy static that starts to sound like a heavy rainstorm, before a warm wash of keys overpowers everything. It makes sense then, that this Barcelona resident studies sound art and programs music for sound installations – his music seems to exist side-by-side with the real world, while creating a whole new environment to explore."},
{"name": "Mano Le Tough", "links": ["https://soundcloud.com/manoletough"], "title": "Worldwide class", "country": "Permanent Vacation /  IE", "venue": "Sónar by Night - SonarPub", "hour": "02:35 - 03:50", "link": "https://sonar.es/en/2016/artists/mano-le-tough", "day": "Friday 17", "description": "Little by little Niall Manion has become one of the European scene’s most popular and in demand DJs, playing weekly in clubs and major festivals around the world, often sharing the bill with the likes of DJs Dixon, John Talabot, Axel Boman and Floating Points. His exquisite taste and unique ability to select the very best in modern house music are qualities that have been present throughout his career. Now a globally renowned artist, he first received recognition from the cognoscenti in his adopted city, Berlin. Manion has also perfected his skills as a remixer and producer in a similar vein to his career as a DJ: Moving unhurriedly with consummate ease, with a clear and concise idea of which direction to take. In 2015 he consolidated his position as an artist largely thanks to the release of \"Trails\", his second and most ambitious album to date, released on Permanent Vacation. It is an album that further underlines his understanding of house music, concentrating on it's emotional charge as well as its physical effect.\r\n\r\nHailing from Ireland and recently relocating to Zurich, Manion has spent much of his career operating from Berlin. He began to forge his current reputation in the German capital by playing at the city’s key clubs and actively participating in its legendary nightlife scene. Since 2009 he has released his own material on labels like Mirau and Internasjonal. By 2012 he had already established himself as a leading DJ on the on the European scene and released his first material on Permanent Vacation, starting with the 12\" \"Mountains\", later followed by the album \"Changing Days\". The two LPs (and single) focused on the more accessible side of his work, meanwhile in the DJ booth he continued to demonstrate his razor-sharp and versatile taste, mixing electronic dance music in all its guises with supreme precision."},
{"name": "Matias Aguayo", "links": ["https://soundcloud.com/donmatiasaguayo"], "title": "Tasty Bass", "country": "Cómeme /  CL", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "21:00 - 23:00", "link": "https://sonar.es/en/2016/artists/matias-aguayo", "day": "Friday 17", "description": "Friday at SonarVillage will close in the best possible way, with a succulent, otherworldly, dance set from the mighty Matias Aguayo. The Chilean producer based in Frankfurt is on top form: he has recently released a raft of genre pushing material including the raw dance of the four \"El Rudo's House\" EPs and the deeper techno of \"Legend\" on Kompakt; has launched new group Rionegro (with Sano and Gladkazuka); and still masterfully runs his own label Cómeme, perhaps the finest exponent of Latin electronica in the world. Each time Aguayo takes to the stage he unleashes his artistic nature, mixing mutant techno with luscious house, using his voice as extra instrument while somehow performing seemingly impossible choreographed dance routines. Aguayo is a showman, but above all is a superlative artist.\r\n\r\nMatias Aguayo was a key name in 90s German electronic music thanks to his electro, dark new wave and ambient productions with Dirk Leyers as Closer Musik. He is a long time associate of Michael Mayer’s Kompakt empire and has always maintained his taste and predeliction for Latin rhythms, which naturally began to flourish while he was honing his skills as a producer and singer. As a solo artist this first came to fruition with the singles \"minimal\" and his first album \"Are You Really Lost?\" later followed by the sensational \"Ay Ay Ay\" and \"The Visitor\" LPs full of clearly Latin influenced hits like \"The Sucu Tucu\" and\" Rollerskate\". He founded Cómeme in 2009 releasing music from artists such as Mexico's Rebolledo – his partner in crime typically found on stage or in the studio with him during that time- and for uncovering new producers such as Daniel Maloso, Ana Helder, Lena Willikens and Alejandro Paz."},
{"name": "Melé & Monki’s NRG FLASH", "links": ["https://soundcloud.com/ukmele", "https://soundcloud.com/monki-1"], "title": "The UK’s most innovative duo", "country": "UK", "venue": "Sónar by Night - SonarLab", "hour": "00:35 - 01:55", "link": "https://sonar.es/en/2016/artists/mele-monki-s-nrg-flash", "day": "Saturday 18", "description": "'Energy Flash' - The title of Joey Beltram's rave anthem, and Simon Reynolds definitive work on the acid house and techno movement. And now, re-written as NRG FLASH, it's the name of a new and exciting bass and electro duo formed by famed producer and DJ Melé and radio host Monki. Joining forces, talents and their respective record collections they're taking over the most important DJ booths across the continent, using a three-deck format and hugely imaginative visuals. Sónar by Night will be the ideal place for them to show us what they are capable of.\r\n\r\nMerseyside’s Melé has spent five years moving steadily through all genres of British descent, from grime to bass music, through to UK funky and new techno. Melé runs the Quadrant label, and has remixed Disclosure, Lianne LaHavas, The 2 Bears and Gucci Mane among others, and always demonstrates a fresh and versatile ability in the studio, as well as on the decks. His partner in grime Monki (Lucy Monkman) is one of the RinseFM Family’s youngest presenters and has also featured on BBC Radio 1. She has collaborated on mixes and compilations for several labels, runs her own digital platform ZOO Music and is one of the UK’s brightest DJs, with a vast knowledge of the latest trends in the international electronic music scene."},
{"name": "Mikael Seifu", "links": ["https://soundcloud.com/mikaelseifu"], "title": "The new sound of Ethiopia", "country": "RVNG Intl. /  ET", "venue": "Sónar by Day - SonarHall", "hour": "16:00 - 17:00", "link": "https://sonar.es/en/2016/artists/mikael-seifu", "day": "Friday 17", "description": "There are echoes of Mulatu Astatke and the golden age of Ethio-jazz in Mikael Seifu’s music, blended harmoniously with elongated synthetic developments, cutting edge beats and cosmic funk; an unlikely cross somewhere between Hailu Mergia, Burial and Flying Lotus. These are the fascinating sonic pathways, which his new album \"Zelalem\" travels, released this year on the prestigious American label RVNG Intl, following his much-celebrated EP \"Yarada Lij\" in 2014. On \"Zelalem\", meaning \"eternity\" in his mother tongue, Seifu takes us through the modern sounds of Addis Ababa and reveals a new genre, \"Ethiopiyawi Electronic\", which can be described as the contrast between Ethiopian folklore’s ancient instruments (such as the krar or Masenko) and modern digital production processes.\r\n\r\nSeifu grew up in the large Ethiopian metropolis listening to rap and electronic music on the Internet, much like any other young man of his generation. His interest and talent for music led him to travel to the United States and study at New Jersey’s Ramapo College. After a couple of years in America and an enlightening encounter with trumpeter Ben Neill (collaborator and pupil of La Monte Young), Seifu decided to return home and explore in depth the history of Ethiopian music, in order to discover and develop his own sound. His journey has been meticulous and honest, giving as a result some new fresh music that he will share performing live at Sónar by Day, in the unique setting of SonarHall."},
{"name": "Mind Against", "links": ["https://soundcloud.com/mindagainst"], "title": "Spiralling progression", "country": "Life & Death /  IT", "venue": "Sónar by Night - SonarClub", "hour": "02:15 - 03:25", "link": "https://sonar.es/en/2016/artists/mind-against", "day": "Friday 17", "description": "Brothers Alessandro and Federico Fognini have for some time now been cornerstones of the Italian label Life & Death, to the extent that they are currently involved in its management and the search for new artists. Berlin residents - and part of a loose scene of European producers that include their good friends Tale Of Us -, the duo have carved out their own hotly contested space in the city, playing at the intersection between IDM, house and techno. Their precise and penetrating sound will lead the way on Friday night, before Richie Hawtin's performance at SonarClub.\r\n\r\nThe name Mind Against began at Sónar and received early critical acclaim in 2014 thanks to a trio of EPs on Life & Death, “Atlant”, “Avalon” and “Strange Days” as well as remixes for Róisín Murphy and WhoMadeWho. Last year they briefly betrayed the label (so to speak) recording an album together with Locked Groove for Hotflush (the label managed by Scuba). They then returned home with the release of two shared EPs, one with the Milanese producer Somne, and the more recent “Astral” with their regular partners in crime, Tale Of Us. Over the last year they have taken a major leap forward, becoming increasingly popular, it is therefore the perfect opportunity to see them perform at Sónar before their careers go stratospheric."},
{"name": "N.M.O.", "links": ["http://n-m-o.tk/", "https://soundcloud.com/n-m-o-5"], "title": "Nitrogen Mercury Oxygen", "country": "Diagonal /  ES - NO", "venue": "Sónar by Day - SonarComplex", "hour": "14:00 - 14:30", "link": "https://sonar.es/en/2016/artists/n-m-o", "day": "Saturday 18", "description": "Behind the acronym N.M.O. are hide two musicians engaged in an on-going exploration of their art: Barcelona's Rubén Patiño and the Norwegian Morten J. Olsen. More knowledgeable listeners will know them from their previous work, and for those who don't, they have the perfect opportunity to discover their amazing sound over the coming months: firstly with their new album on Diagonal, one of of today’s most important labels in contemporary European electronic music (led by Oscar Powell); secondly via a joint EP with Exotèric Continent, on Catalan label Anòmia; and finally, the culmination of their efforts, a live show at Sónar by Day combining drum beats, analogue synthesizers, offstage performances and visual devices.\r\n\r\nN.M.O. revamp techno, IDM, and rave hardcore rave structures to deliver a physical and powerful sound, operating in a territory somewhere between club music and scientific research. Their shows typically include situations where they purposely break with convention and challenge the passive listening experience of their audience. Another of their hallmarks is to frequently change the meaning of their acronym, with their most recent release on the prestigious Boomkat label being attributed to \"Naturkunde Museum Ostkreuz\", soon followed by the \"Natalia Martinez Ordóñez EP\", on the label Where To Now?. Their new material on Diagonal, perhaps their best to date, follows in the same vein with a dual title: Nordic Mediterranean Organization / Numerous Miscommunications Occur."},
{"name": "New Order", "links": ["http://www.neworder.com", "https://soundcloud.com/neworderofficial"], "title": "Back on top", "country": "Mute /  UK", "venue": "Sónar by Night - SonarClub", "hour": "22:30 - 00:00", "link": "https://sonar.es/en/2016/artists/new-order", "day": "Saturday 18", "description": "Once again, New Order are the the name on everyone’s lips thanks to their new album \"Music Complete\", which has been unanimously heralded as one of the best in their career, equalling the dizzy heights of classics like \"Technique\" or \"Republic\". It has been almost ten years since the legendary English group released a studio album, but the long wait has been rewarded with an album that recaptures some of their key traits: perfect melodies, the ageless voice of Bernard Sumner, the Peter Saville cover design and the return of Gillian Gilbert to the band. \"Music Complete\" includes collaborations with La Roux, Iggy Pop, Tom Rowlands and Brandon Flowers, and we must not forget that the album appears on Daniel Miller’s label Mute, and sees him in the role of executive producer. Everything is therefore once again in place for New Order, who will arrive at Sónar by Night armed with a collection of new songs that seamlessly blend with timeless classics like \"Bizarre Love Triangle\", \"True Faith\", \"Temptation\" and \"Blue Monday\".\r\n\r\nNew Order need little introduction. Rising from the ashes of Joy Division with remarkable vigour and a new sound, to become one of the most important and influential groups of the last 30 years. From the very beginning it was clear that New Order would change the course of pop. This was soon to be confirmed in 1983 with the astonishing impact of \"Blue Monday\", the best-selling dance track in history. The rest as they say is history: a handful of masterpieces (\"Power, Corruption & Lies,\" \"Brotherhood\", \"Low Life\"), world tours, countless accolades and a legacy of magnificent songs that have inspired (and continue to inspire) thousands of bands and artists the world over."},
{"name": "Nicola Cruz", "links": ["https://soundcloud.com/nicolacruz", "http://zzkrecords.com/artist/nicola_cruz"], "title": "The Andean tradition revisited", "country": "ZZK Records /  EC", "venue": "Sónar by Day - SonarHall", "hour": "16:00 - 17:00", "link": "https://sonar.es/en/2016/artists/nicola-cruz", "day": "Thursday 16", "description": "Nicola Cruz’s work has a clear direction and a specific source: the Ecuadorian Andes, where his roots can be traced. Although born in Limoges, France, Cruz lives and works in Quito, and much of his inspiration comes from the landscape, folklore and instrumentation characterized by the enormous mountain range and Amazon rainforest. Cruz incorporates past myths and sounds, revamping them using current production techniques and adding seductive electronic textures. All this is perfectly embodied by his debut album, \"Prender el Alma\", which he will present live on the SonarHall stage.\r\n\r\nCruz began his career as a percussionist, but quickly became fascinated with electronica. His music is an original blend of tradition and technology, open exploration of large landscapes and an intimate and personal examination. His sound and style are also shaped by his previous work in the area of sound installations, field recordings and soundtrack composition. In 2011 he collaborated with Nicolas Jaar on his label, Clown & Sunset, which opened doors to a wider audience in the United States, where he performed at emblematic venues like the PS1 in New York (MoMA headquarters in Queens) and the Echoplex in Los Angeles."},
{"name": "Niño de Elche + Los Voluble: “En el Nombre de”", "links": ["http://www.ninodeelche.net", "http://www.voluble.net"], "title": "Second round", "country": "ES", "venue": "Sónar by Day - SonarComplex", "hour": "18:30 - 19:20", "link": "https://sonar.es/en/2016/artists/nino-de-elche-los-voluble-en-el-nombre-de", "day": "Friday 17", "description": "After the overwhelming success of last year’s \"Raverdial\" in SonarComplex, Niño de Elche and Los Voluble return to the festival to exclusively present their new project “En el Nombre de”. As well as the \"cantaor\" (famenco singer) and the Seville remix duo, the new show will feature multi-instrumentalist Pablo Peña (Pony Bravo, Fiera) and regular Niño de Elche collaborator, guitarist Raúl Cantizano. \"En el Nombre de\" focus its narrative in the Mediterraneans sea as a cultural exchange centre and takes the \"cantes de ida y vuelta\" (go-and-come chants) to cross them with today’s EU foreign policy, converting the sea into a graveyard full of anonymous corpses. Multiplying borders and bodies in transit appear in the lyrics of Niño de Elche, remixing unidentified songs and writings by queer philosopher and activist Paul B. Prciado, creating a dialogue together with Los Voluble through a network of texts, images and sounds set to the rhythm of the rawest frontier crossing electronica.\r\n\r\nFrancisco Contreras Molina (Niño de Elche) is an unconventional artist. He is a guitarist, songwriter, singer and performer of extraordinary talent whose activity over the last year and a half has been somewhat frenetic, including rock, flamenco, improvisation, electronic and dance projects. His album \"Voces del Extremo\" was considered by critics one of the most important works to be released in Spain in 2015, and its transition to a live performance was also unanimously praised. Pedro and Benito Jimenez formed Los Voluble in 1996, a VJ / DJ duo who thrive on audiovisual experimentation, improvisation, political commentary and a sharp sense of humour. “En el Nombre de” is their second project together, following \"Raverdial\" the mix of rave (with all the political and social implications and appealing to the roots of underground parties) and verdiales (a form of flamenco inseparable from the fiesta spirit), which was a resounding success at Sónar 2015."},
{"name": "Noaipre", "links": ["https://soundcloud.com/noaipre"], "title": "Drums to infinity", "country": "ES", "venue": "Sónar by Night - SonarLab", "hour": "21:30 - 22:30", "link": "https://sonar.es/en/2016/artists/noaipre", "day": "Friday 17", "description": "Besides his well-known skills as a producer, Noaipre is an excellent DJ whose sets embrace the modern trends emerging from ghetto culture worldwide; Lisbon to Chicago, via London or Rio. Footwork, baile funk, Jersey and Baltimore club, Bay Area rap, London grime and a whole host of micro-genres pass through his rapidly moving hands, giving shape to a distinctive sound tied together by his dedication to rhythm or, in his own parlance 'The Drum'. Dynamic and self-demanding, this Gallician (now residing in Valencia) operates outside the traditional music marketplace and is experiencing an effervescent creative period that may result in the release of new EPs and tracks throughout 2016.\r\n\r\nNoaipre began his career on the Arkestra label run by his friend Mwëslee, with whom he remains closely linked. He has released material on Iberian Records and Ho Tep ( a sublabel of Eglo Records), and in recent years has established many useful connections with the British underground scene. This has resulted in his tracks recently being heard in mixes and sets by figures such as Murlo, Slackk, Mr. Mitch, and on the airwaves for Rinse FM in one of the shows by the Lucky Me collective."},
{"name": "Nozinja", "links": ["https://soundcloud.com/nozinja"], "title": "Shangaan master", "country": "Nozinja Music /  SA", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "18:15 - 19:00", "link": "https://sonar.es/en/2016/artists/nozinja", "day": "Saturday 18", "description": "The king of Shangaan electro comes to Sónar and will step up the pace at SonarVillage with one of his thrilling concerts fusing traditional African dance and electronic music at more than 140 bpm. The musician from Limpopo will present tracks from \"Nozinja Lodge\" his debut album on Warp, released in 2015. His signing to the infamous UK label (home to Autechre and Boards Of Canada, among many others) demonstrates the enormous interest his rhythms have aroused in the Western world. However his international standing goes beyond just Warp: last year he recorded the 12” \"Thinking Of You\" with Micachu, Mumdance and Tirza, which was released on The Vinyl Factory, and had Wire magazine devoting pages of extensive reviews. This will be his second visit to Sónar after the energetic show together with the Shangaan Electro collective in 2011.\r\n\r\nAlthough born in Gyani in the north of South Africa, it was Soweto where Nozinja (real name Richard Mthetwa) developed the Shangaan electro sound in the early part of this century. Fascinated by the strange, jerky street party dance music in the suburbs of Johannesburg, Nozinja infused his own electronic polyrhythms to an already ecstatic and explosive sound that mixed kwaito house and tsonga disco. The movement in its infancy was documented by a variety of cassettes, DVDs and CD-Rs edited by Nozinja Productions, the label created by Mthetwa. Shortly after, artists like Caribou, Ben UFO and Pearson Sound began to incorporate several of these tracks into their dj sets, with British label Honest Jons chiefly responsible for spreading the virus throughout Europe via two essential compilations: \"Shangaan Electro: New Wave Dance Music From South Africa\" and \"Shangaan Shake\", the latter featuring remixes from Theo Parrish, Rashad & Spinn, Hype Williams and Actress, among others."},
{"name": "Oneohtrix Point Never", "links": ["http://pointnever.com/", "https://soundcloud.com/oneohtrix-point-never"], "title": "Where anything is possible", "country": "Warp /  US", "venue": "Sónar by Day - SonarHall", "hour": "18:30 - 19:30", "link": "https://sonar.es/en/2016/artists/oneohtrix-point-never", "day": "Saturday 18", "description": "Pushing things forward, behind the strange and incomparable Oneohtrix Point Never moniker is Daniel Lopatin. Following the superb \"R Plus Seven\" in 2013, the Russian-born American producer more recently released \"Garden of Delete\", his second album for Warp, an even more ambitious affair than its predecessor. And as if that were not enough, he will also form part of the Anohni project, along with Antony Hegarty and Hudson Mohawke, whose performance together at Sónar by Night will most definitely be one of this year’s highlights. As is typical of his music, \"Garden of Delete\" provides seemingly impossible sounds: new age passages, convoluted digital processes, his own black metal and grunge riffs (he recently toured with Soundgarden and Nine Inch Nails), r&b beats, noise bursts and delicate string chords. Lopatin, who has recently recorded a full album with Teklife's DJ Earl, will touch down at Sónar armed with a multimedia show created by visual artist Nate Boyce.\r\n\r\nThe son of Russian immigrants, Lopatin started Oneohtrix Point Never in order to explore the sounds of his childhood and adolescence, moving into the realm of digital creation and visionary electronica. Among his arsenal of instruments, perhaps the most important is his father’s antiquated synthesizer, which he has used in most of his works in tandem with his boundless imagination. Although he had already recorded a handful of albums between 2007 and 2009 (partially represented by the compilation \"Rifts\"), his music began to receive recognition after \"Returnal\", released in 2010 by Editions Mego, and later through two fundamental pieces of contemporary electronica; \"Replica\" (released on his own label, Software Records in 2011) and \"R Plus Seven\" on Warp. \"Garden of Delete\" adds yet another notch to a discography that is undoubtedly one of the most original corpuses of expansive and stimulating works in recent years."},
{"name": "Paco Osuna", "links": ["https://soundcloud.com/paco-osuna"], "title": "Worldwide dj", "country": "ES", "venue": "Sónar by Night - SonarClub", "hour": "05:35 - 07:00", "link": "https://sonar.es/en/2016/artists/paco-osuna", "day": "Saturday 18", "description": "Paco Osuna is now one of Spain’s most internationally renowned artists. He is also undoubtedly the most travelled, playing worldwide at all kinds of venues, festivals and events in Europe, Asia, America, and beyond. Osuna’s career spans more than 20 years and is typified by hard work; a powerful and flexible sound that can adapt to any given situation; and the constant search for new musical expression. All of his sets are important to him. He maintains his fresh approach and energy through invention and constant renewal, and is fully committed to each performance regardless of the location or occasion. This year he will take control of one of the festival’s key slots, by playing the closing set at SonarClub, the biggest stage at Sónar by Night.\r\n\r\nImmersing himself in techno and dance music since his formative years, at just 20 years old Osuna founded his first label and became the resident DJ at the legendary Ibiza club Amnesia. This period on the Magic Island brought him into contact with famous figures from the international scene including Sven Väth, Carl Cox, Marco Carola and, of course, Richie Hawtin. More than ten years on, Hawtin and Osuna continue to work together and maintain a close personal and artistic relationship. Along with his infectious charisma and experience behind the decks, Osuna also ran Barcelona’s Club4 Mindshake night as well as having released tracks on labels like Plus 8, Spectral and M_nus; consolidating his reputation among lovers of minimal and dark techno throughout the world."},
{"name": "Pulsinger & Irl", "links": ["https://soundcloud.com/sam-irl", "https://soundcloud.com/patrick-pulsinger"], "title": "Analog couple", "country": "AT", "venue": "Sónar by Day - SonarDôme", "hour": "17:15 - 18:00", "link": "https://sonar.es/en/2016/artists/pulsinger-irl", "day": "Friday 17", "description": "Pulsinger & Irl is the collaborative project between Austrian producer and techno pioneer Patrick Pulsinger, and Bavarian producer and sound engineer Sam Irl. Their cooperation began a few years ago behind the mixing board of Patrick Pulsinger’s Feedback Studio in Vienna, where Sam Irl started out working as his assistant recording engineer. Hailing from different musical backgrounds, they found a mutual connection between experimental techno, sample-heavy dub and jazz, and their love for analog machinery. Their live set aims at capturing the essential vibe of live-performed techno and house music, working only with drum computers, a MPC sampler, analog synthesizers and a series of dub-heavy effects recalling the atmosphere of Jamaican dub culture, early Detroit techno and contemporary electronics. For over 20 years, Patrick Pulsinger has been releasing music on his own label, Cheap Records, as well as numerous international imprints like R&S, M Plant and Disko B, and worked as a producer with artists like DJ Hell, Hercules & Love Affair, Elektro Guzzi, Fennesz and many more. Sam Irl has released his music on labels such as Gilles Peterson’s Brownswood Recordings (together with Ritornell), Jazz & Milk, Bonzzaj Rec. (together with Dorian Concept), Frank Music and Pulver Records."},
{"name": "Red Axes", "links": ["https://soundcloud.com/redaxes"], "title": "Dynamic duo", "country": "I’m a Cliché /  IR", "venue": "Sónar by Night - SonarPub", "hour": "00:20 - 01:20", "link": "https://sonar.es/en/2016/artists/red-axes", "day": "Friday 17", "description": "2015 confirmed what many had previously thought in 2014: Red Axes are not only very good, but have also managed -in just over three years- to establish their own unique sound, an undertaking which, for other producers, cann take an entire career to accomplish. The quality of their work and the essence of their music is perfectly defined by the quartet of EPs released last year: \"Pil Sagol\" on Hivern (John Talabot’s label); \"Shem Vol.1\" and \"Shem Vol. 2\" on I'm A Cliché, and \"Waiting For a Surprise\" on Multi Culti, to which we should also add their single on Crosstown Rebels remixed by Isolée. The dominant genre in their work is house; an oblique, magnetic, unconventional often slow bpm house that loses none of its dance floor effectiveness, infused by string arrangements, Brazilian voices, dry percussion, psychedelic synths and other irresistible hooks that impressively enrich every track.\r\n\r\nPart of the bustling Tel Aviv scene for many years, Red Axes is comprised of Dori Sadovnik and Niv Arzi. They formed in 2010 after the disbanding of rock group Red Cotton in which both played. No doubt their history as musicians has greatly influenced their productions by bringing stylistic variety to their music. This is certainly the case for their excellent (and to date, only) album \"Ballad of The Ice\", a perfect combination of dance and psychedelic music, expressed through a global vision and short, almost pop like, track lengths. Also worthy of note are their energetic and natural live shows that shy away from the clichés of rock guitars, focusing fully on house beats. Hyperactive and nocturnal, the duo is currently in a particularly creative purple patch, with a plethora of new music planned for release during the first half of 2016. They have also recently launched their own label label, Garzen Records, in order to showcase new artists and emerging Israeli producers."},
{"name": "Richie Hawtin", "links": ["http://www.m-nus.com", "https://soundcloud.com/richiehawtin"], "title": "The debut of a brand new show", "country": "", "venue": "Sónar by Night - SonarClub", "hour": "03:30 - 05:00", "link": "https://sonar.es/en/2016/artists/richie-hawtin", "day": "Friday 17", "description": "Debuting a completely new show at Sónar 2016, which will be presented officially within the next weeks, Richie Hawtin takes another giant leap forward in his dedication to music, art and technology.\r\n\r\nAt the end of 2015, this Canadian creative - an artist constantly in touch with the present and near future - released the excellent \"From My Mind To Yours\", an LP that resurrects many of the aliases that Hawtin has used throughout his career (Plastikman, Circuit Breaker, F.U.S.E.), while updating the signature sound that has made him one of the most consistently relevant figures in electronica. Recently having contributed again to BBC Radio 1's Essential Mix series, as well as announcing his collaboration in the creation of a new music hardware, Hawtin is, as ever, a man in constant momentum.\r\n\r\nAs well as these more recent endeavours, Hawtin has been working ferociously over the last few years - from the curation of his ENTER. events to his collaborations with Turner Prize winning artist Anish Kapoor, or the Italian coreographer Enzo Cosimi. Indefatigable and polifacetic, he's also completed a lecture tour of North American universities with the CNTRL concept, composed an alternative soundtrack for the 1928 silent film 'Brume d'Automne' , and returned to his Plastikman alias with a full length record 'EX' and a corresponding live show that he performed at Sónar 2014."},
{"name": "Roots Manuva", "links": ["http://www.rootsmanuva.co.uk/"], "title": "Hip-hop exemplified", "country": "Big Dada /  UK", "venue": "Sónar by Day - SonarHall", "hour": "19:00 - 20:00", "link": "https://sonar.es/en/2016/artists/roots-manuva", "day": "Friday 17", "description": "Widely admired, respected and considered to be one of Britain’s most important hip-hop MCs, in 2015 Roots Manuva released his sixth studio album, \"Bleeds\". The vocalist from Stockwell worked on the new album with the young English producer Fred, as well as collaborating with heavyweights including Four Tet, Adrian Sherwood and Switch. Together they have created an album of mature and insightful compositions that exude wisdom and see him take full command of his own sound. Manuva returns turns to his characteristic soulful vibe (with Barry White samples included), dub, Jazz-funk and elements of techno that add intricate nuances to his rugged brand of hip-hop. His presence alone on the SónarHall stage raises the bar at this year’s festival.\r\n\r\nRodney Smith came to prominece in 1999 with the release of his debut album \"Brand New Second Hand\" that took the UK and worldwide hip-hop scene by storm. Since then under the umbrella of the Big Dada label, an imprint of Ninja Tune created to broadcast the UK’s best rap and urban rhythms, Smith has developed a rock solid career (with classic albums like \"Awfully Deep\" and \"Run Come Save Me\"). He has skilfully avoided the trappings of fame and remains somewhat elusive, maintaining a spirituality inherited from his father, a West Indian preacher. Manuva is now recognised as a progenitor of grime, and throughout his career he has constantly pushed at the limits of his sound, thanks to collaborations with artists including Jamie Cullum, DJ Shadow, UNKLE, The Cinematic Orchestra, Gorillaz, Beth Orton and Coldcut, among many others."},
{"name": "Santigold", "links": ["http://tumblr.santigold.com", "https://soundcloud.com/santigold"], "title": "A triumphant comeback", "country": "US", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "20:00 - 21:00", "link": "https://sonar.es/en/2016/artists/santigold", "day": "Friday 17", "description": "After four long years of anticipation Santigold is back with a new album \"99¢\", following her previous work \"Master Of My Make Believe\" in 2012. In recent interviews she has explained how hard she had been working during this period, and listening to her new album it is abundantly clear that the effort was more than worthwhile. Two perfect examples already in circulation as early singles are: the vibrant \"Can’t Get Enough Of Myself\", characteristically flawless pop drawing from funk, hip-hop and reggae; and \"Who Be Lovin Me\", a magnetic mid tempo trap which sees her collaborate with ILoveMakonnen on the mic, and whose video included appearances from A-Trak, De La Soul, DJ Mustard and Earl Sweatshirt, among others. On \"99¢\" the Philadelphia artist critically but humorously reflects on the obsession with perfection and the commercial nature of our lives, discernible from the title and the cover art by Japanese photographer Haruhiko Kawaguchi. The momentous return of Santigold will be served in double helpings: Friday at Sónar by Day (SonarVillage) and Saturday at Sónar by Night (SonarPub).\r\n\r\nA songwriter, producer and singer with an extensive catalogue, Santi White drew worldwide attention with her first single in 2007 under the pseudonym Santogold. Following her critically acclaimed debut album –much lauded for its originality and fusion of genres and styles- came her second album, \"Master of My Make Believe\" which reached the top of the charts, winning all sorts of awards and nominations, despite its deeper and darker nature. Always artistically true to herself and in a constant state of flux, Santigold has collaborated with producers and artists like Diplo, Switch, Dave Sitek of TV On The Radio fame (who returns to add production to\"99 ¢\"), MIA, Jay-Z, The Streets and Beastie Boys. Her songs including “LES Artistes”, “Disparate Youth” or “Go!” are mainstays on radio, club, and dj playlists all over the world."},
{"name": "Sapphire Slows", "links": ["https://soundcloud.com/sapphire-slows"], "title": "Opposites atract", "country": "100% Silk /  JP", "venue": "Sónar by Day - SonarDôme", "hour": "15:35 - 16:20", "link": "https://sonar.es/en/2016/artists/sapphire-slows", "day": "Friday 17", "description": "Sapphire Slows is what you might call an everything-ist: she produces, DJs, plays synth and keyboard, and her eerie, drone-like vocals float over her tracks, embellishing their shadowy textures. After the brutal awakening of the 2011 earthquakes in Japan, she became motivated to pursue a career in music. Now a notable name in Tokyo’s house scene, she has toured North America, Europe, China and her home country, and released on labels such as Japan’s Big Love and Los Angeles’ 100% Silk. While some of her songs are submerged in a blue-ish, slo-mo haze, like her name suggests, others are more abrasive and in tune with the whirring pace of krautrock, as on 2014’s Allegoria album. A keen interest in crate digging, a healthy disregard for music nostalgia and her own lucid dreams help root Sapphire Slows' music in the future."},
{"name": "Section Boyz", "links": [], "title": "Road Rap", "country": "S4P$ Records /  UK", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "20:15 - 21:00", "link": "https://sonar.es/en/2016/artists/section-boyz", "day": "Saturday 18", "description": "Section Boyz are the new hip-hop sensation in the UK. Originating from south London, the group formed by Swift, Deepee, Sleeks, Knine, Inch & Littlez are revolutionizing the English capital’s long-standing rap scene. Up until this point they have only released the mixtape, \"Don't Panic\", but -as also transpired with PXXR GVNG in Spain- the key to their success is their dazzling array of videos, where the quality of their sound and lyrics is patently obvious. At the time of writing the \"Trapping Ain’t Dead\" video has already been seen by two million people, and \"Delete My Number\" by one and a half million and counting. Although they are connected to the grime world (being friends with new genre leaders like Stormzy) their sound is more akin to high-powered hip hop, finding the perfect balance between its classical forms and the latest production techniques of trap and cloud rap, leaving sufficient space for the lyrical flow to shine. Just recently they were named the best group / debut artist of the year at the MOBO Awards, which is sure to be the first of many. The Section Boyz sound is some serious bizness."},
{"name": "Sevdaliza", "links": ["https://soundcloud.com/sevdaliza"], "title": "Dark seduction", "country": "NL", "venue": "Sónar by Day - SonarDôme", "hour": "17:30 - 18:20", "link": "https://sonar.es/en/2016/artists/sevdaliza", "day": "Thursday 16", "description": "Rotterdam’s Sevdaliza comes through with a voice that could melt butter, bass that will blow your speakers, and the kind of otherworldly effects that speak of her ability to conjure up strange new feelings and wondrous worlds. Born in Tehran and raised in The Netherlands, this former basketball star and rapper has transformed into a straight-up siren: churning out catchy, sexy electro one second, then melting it all down into a dark and twisted experimental fantasy the next. A perfectionist when it comes to sound design, Sevdaliza nonetheless writes very intuitively. “I never force a song\", she says. The Fader and Noisey have already been seduced by Sevdaliza’s talent. Don’t be surprised if you’re next."},
{"name": "Silkersoft", "links": ["https://soundcloud.com/silkersoft"], "title": "Videogames", "country": "Activia Benz /  DE", "venue": "Sónar by Day - SonarDôme", "hour": "14:45 - 15:30", "link": "https://sonar.es/en/2016/artists/silkersoft", "day": "Friday 17", "description": "The video game Chrono Trigger changed Silkersoft’s life, and you can hear it – and the influence of other video game composers like Yasunori Mitsuda – in his music. (His mom once said that listening to his music gave her flashbacks of seeing him in front of an N64.) The Gronau-based producer composes everything on his PC, and there’s a sheen that makes his tracks glide and twinkle. It sounds like something from another planet, but it has a crucial human touch as well. And while his self-professed “killer black metal growl” hasn’t made it into his tracks yet, we’re betting he’ll find a way to make it a part of his imaginary soundtracks soon."},
{"name": "Skepta", "links": ["http://helloskepta.com", "https://soundcloud.com/skepta"], "title": "Grime star", "country": "Boy Better Know /  UK", "venue": "Sónar by Night - SonarPub", "hour": "01:25 - 02:10", "link": "https://sonar.es/en/2016/artists/skepta", "day": "Saturday 18", "description": "After last year’s super-charged concert with his brother JME, the king of grime returns to Sónar. This time he will perform solo to close the SónarDôme stage and present his highly anticipated fourth album \"Konnichiwa\", almost five years after \"Doin 'It Again\". It comes at a time in which grime has made a powerful return to the forefront of the international scene. This has allowed Skepta’s talent to finally receive the recognition it deserves beyond London and the UK, and sees him transcending genre boundaries, rubbing shoulders with leading figures in the rap and pop world. The Tottenham MC has formed a partnership with Drake to remix a track by Nigerian singer Wizkid; has appeared in a short film directed by A$AP Rocky at the Kanye West concert in London; has achieved global success with \"That's Not Me\" and \"Shutdown\"; and received honours for his \"outstanding contribution to music\" at the British Independent Music Awards.\r\n\r\nJoseph Junior Adenuga of Nigerian origin, began as a dj for the Meridian Crew more than a decade ago, before temporarily joining Roll Deep, one of grime culture’s key collectives. In 2006 he founded label Boy Better Know, releasing several mixtapes, twenty EPs and the albums \"Greatest Hits\", \"Microphone Champion\" and \"Doin 'It Again\" with his brother. Restless and resourceful, at the start of the year Skepta recorded a mixtape together with Tim Westwood that he then distributed on the streets of New York; and he recently included several verses on a new remix of Jamie xx \"I know there's gonna be (good times)\". He is most definitely on a roll."},
{"name": "Sobrenadar", "links": ["https://soundcloud.com/sobrenadar"], "title": "Dreamy electronics", "country": "AR", "venue": "Sónar by Day - SonarDôme", "hour": "13:00 - 13:45", "link": "https://sonar.es/en/2016/artists/sobrenadar", "day": "Friday 17", "description": "A studied music producer, Paula Soledad Garcia is doing whatever it takes to stay afloat as a musician in Buenos Aires. Besides making supremely dreamy, Cocteau Twins-inspired synth pop as Sobrenadar, she also composes music for short films and advertisements, teaches classes, and works as composer and assistant in recording studios. Lately her main project has been picking up steam, and Paula says that she feels fortunate to be playing a lot and traveling to other countries."},
{"name": "Soft Revolvers by Myriam Bleau", "links": ["http://www.myriambleau.com/"], "title": "++", "country": "CA", "venue": "Sónar by Day - SonarComplex", "hour": "17:00 - 17:25", "link": "https://sonar.es/en/2016/artists/soft-revolvers-by-myriam-bleau", "day": "Friday 17", "description": "\"Soft Revolvers\" is the new show and project from Montreal artist Myriam Bleau. This is a performance show in which the creator manipulates four transparent acrylic spinning tops/disks that emit light and sound. Each of these rotating disks is associated with an instrument or a type of sound used in electronic compositions, with a sensor generating sound data algorithms. Its circular shape, the manner in which it moves, and the motion caused by Bleau’s manipulation, is not dissimilar to spinning vinyl on the turntables in a dj set. LEDs installed in each of the devices create a halo of light consistent with its velocity, creating an impressive visual experience that also unfolds on a screen behind the artist. Musically, the \"Soft Revolvers\" compositions oscillate between the experimental side of IDM, danceable techno and hip-hop beats, with patterns appearing and disappearing according to the disk’s rotation, thus achieving a constantly evolving hypnotic effect.\r\n\r\nA multi-instrumentalist (she expertly plays the guitar, cello and piano), composer and sound artist, Myriam Bleau is invested in exploring the relationship between space, sound and art in the field of digital creation, either through sound installations, new musical interfaces, or live shows where she puts her discoveries to the test. Bleau has presented her work and projects at various festivals across America and Europe and was recently awarded a special distinction by the jury for the Prix Ars Electronica for her work on the \"Soft Revolvers\" project. She is currently working on her Masters Degree for composition, at the University of Montreal."},
{"name": "Soichi Terada", "links": ["https://soundcloud.com/soichi-terada"], "title": "The Godfather of Japanese house", "country": "Far East Recording /  JP", "venue": "Sónar by Night - SonarLab", "hour": "00:30 - 01:30", "link": "https://sonar.es/en/2016/artists/soichi-terada", "day": "Friday 17", "description": "\"Sounds From The Far East\", last year’s excellent compilation distributed by Rush Hour has finally put a particular problem to bed: to make the western public aware (especially the younger generation) of veteran Japanese music producer Soichi Terada, who since the 90s has been one of the Tokyo house scene’s most important figures. The album, chosen by Resident Advisor as the most important compilation of 2015, reveals the wondrous sound of Terada: American-inspired house music with simple warmth, irresistible melodies, arpeggios and arrangements rooted in the Japanese tradition (close to those of Yellow Magic Orchestra, for example), and an emotional facet rare for dance music.\r\n\r\nTerada's career spans almost 30 years, from the late 80s to the present day, with his first official release coming in 1988. Although connoisseurs of global electronica and house music have revered his excellent albums and his work as head of Far East Recordings for a long time, there are many people who have probably heard his music without even realising it. For instance, he created the soundtrack for seven iterations of the famous Playstation video game \"Ape Escape\" launched in 1999. More recently Terada featured on \"Sounds From The Far East\" (compiled by DJ and Dutch producer Hunee), helping him open the gates to Europe and Sónar by Night, where for the first time we can enjoy live, his elegant, sensitive and captivating disco-garage-house."},
{"name": "Stormzy", "links": ["https://soundcloud.com/stormzy1"], "title": "Grime, r&b and beyond", "country": "UK", "venue": "Sónar by Night - SonarLab", "hour": "02:00 - 02:45", "link": "https://sonar.es/en/2016/artists/stormzy", "day": "Saturday 18", "description": "The new batch of grime is here; and Michael Omari, better known as Stormzy, is one of its strongest exponents. In just one year and with a handful of releases to his name, he was voted the best grime and male artist at the most recent Mobo Awards, with his name included –along with Lewisham MC Novelist- in the latest prestigious BBC \"Sound Of\" list, a survey among critics and specialists conducted annually by the BBC to choose the best new UK artists.\r\n\r\nStormzy’s lyrical flow is strongly reminiscent of that of Dizzee Rascal (with whom he has collaborated in the past), and his imaginative productions demonstrate his ability to escape the typical clichés of the genre. In fact Stormzy has proved that his sound is beyond grime, and easily translates to more thoughtful hip-hop and r&b, probably thanks to the influence of one of his favourite artists, Frank Ocean. The Londoner’s talent and artistic ambition is clearly audible on records like the mini LP \"Dreamers Disease\", his latest single \"WickedSkengman 4\" and his big hit, \"Know Me From\". It can also be heard on two significant recent projects: taking many by surprise with his remix for Nick Jonas, (Jonas Brothers); and via his recent trip to Ghana where he collaborated with local artists, a trip documented by the BBC radio station 1Xtra. His live show at Sónar will surely confirm that this new MC (scarcely 22 years old) is destined to go far."},
{"name": "Strand", "links": ["http://www.strandedsound.com/", "https://soundcloud.com/strandmusic", "https://strand.bandcamp.com/"], "title": "New beats, new rhythms", "country": "Lowriders /  ES", "venue": "Sónar by Day - SonarHall", "hour": "14:30 - 15:10", "link": "https://sonar.es/en/2016/artists/strand", "day": "Thursday 16", "description": "With “Maleza” (EP) and “Malezas” (LP), Miguel Gil Tertre has recently forged a new pathway in his already long and stimulating career. The Madrid born producer and long term Brussels resident, has breathed a new dose of life into his beats, which continue to spread out in multiple directions (grime, footwork, bass, house) but whose sound is now more powerful and compact than ever. Versatile, and with a abundance of tools at his disposal, Strand will perform at Sónar with a brand new show specifically adapted to the SonarHall space: sinuous and dark rhythms, urban environments charged with static electricity, several unreleased compositions and eye-catching home self made visuals. It will be a very special and exclusive concert for Sónar 2016 audience.\r\n\r\nGil Tertre has already spent half his life creating melodies and rhythms. He began releasing albums in the early 2000s on Foehn Records, when his sound was more akin to the pastoral folk of Boards of Canada or Morr Music's electronic indie pop. For a time he was also linked to another leading national electronic label, spa.RK. He has experimented with African and oriental sounds, never losing sight of the hip-hop beats that provide the framework for all of his productions. He has released material on a variety of labels such as Galleta, City Centre Offices, Lovemonk and Lowriders, and has collaborated with renowned American writer Barry Gifford on a multimedia project. In autumn last year, his EP \"Maleza\" was accompanied by an album of remixes released by Disboot, which involved four of the national scene’s principal producers: Cauto, Glue Kids, Niño and Lost Twin."},
{"name": "Talktome", "links": ["http://www.soundcloud.com/talktomemusic"], "title": "Liquid synths", "country": "Factor City /  ES", "venue": "Sónar by Day - SonarDôme", "hour": "13:50 - 14:45", "link": "https://sonar.es/en/2016/artists/talktome", "day": "Saturday 18", "description": "TALKTOME is the third musical identity of Kalet Rodríguez, DJ and producer from Catalonia, after a long musical journey. His first EP for the well-known BCN label Factor City was released at the end of 2014, with heavy influences from his Middle East trips. In the last year, TALKTOME has been focused in the production of new material with collabs from different singers, and preparing a new live show that will be unveiled at SónarDôme. Synthpop, funk or house influences are part of this new project, with a liquid kind of sound, created from out of tune synths in motion. TALKTOME was a participant at RBMA Bass Camp Madrid 2015."},
{"name": "Tendts", "links": ["https://soundcloud.com/tendts"], "title": "Restless brothers", "country": "Fair Weather Friends /  GR", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "13:00 - 14:00", "link": "https://sonar.es/en/2016/artists/tendts", "day": "Saturday 18", "description": "The Tendts soundcloud profile describes “Two brothers makin’ music that you can dance to, or not”. It seems an odd phrase, but aptly explains one of the Greek duo’s merits, a duality that allows the best in pop soul electronica to be enjoyed in equal measure, when heard either on the dance floor, or at home. The compositions of Christos and Fotis Papadakis are both emotive and movement inducing, even though they are written and structured with disparate elements that refuse to fall into obvious patterns. They consist of palpitating beats, imaginative textures, seductive melodies and sporadic bursts of treated vocals. At times reminiscent of a resplendent Bonobo, or the galloping house of Four Tet at his best, and then invoking the cosmic jazz-funk of Flying Lotus. Their live performance includes drum machines, synths and various keyboards, and will open Saturday day at SonarVillage.\r\n\r\nChristos and Fotis have spent a lifetime playing music together, creating sounds and tinkering with instruments in their native Thessaloniki. Some of their earliest joint experiments were included on their first compilation, “Slow Years”, released in 2012. Three more records followed: a four song 12” released on Project Mooncircle; a self-released EP entitled “Accept Failure As Part Of The Process” on which experimental pieces were inspired by their favourite artists (including William S. Burroughs and Joseph Beuys); and more recently four more tracks on the EP “Cheap Poetry” that perfectly embodies their sound universe."},
{"name": "The Black Madonna", "links": ["https://soundcloud.com/theblackmadonna"], "title": "Charismatic house", "country": "Smart Bar /  US", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "18:30 - 20:00", "link": "https://sonar.es/en/2016/artists/the-black-madonna", "day": "Thursday 16", "description": "The Black Madonna (Marea Stamper) suddenly seems to be everywhere. However, while the hype has only started recently, this Chicago scene dj has been around for several years, carving an unyielding reputation from her residency at Smart Bar -one of the City’s and the country’s benchmark clubs- where she has earned the honour of being named one of its official djs -along with Derrick Carter and Frankie Knuckles-. Not content with her work as resident dj, after just one year she also became creative director of the club, the ideal place to showcase her overwhelming personality and implement a philosophy based on fundamentals like the underground, feminism and queer allegiance.\r\n\r\nAlthough largely known for her exciting sets, which blend the most obscure, unknown tracks with carefully selected hits, The Black Madonna is also a great producer. In fact, she began making music under various monikers in her native Kentucky before moving to Chicago, and has continued to produce under her current artist name with hits like \"Exodus\", \"We Do not Need No Music (Thank You Rahaan)\" and \"Stay\", magnetic, contemporary yet classically styled house tracks. The Black Madonna is technically gifted and knowledgeable, with fresh ideas and enthusiasm, essential qualities for any dj worth their salt, making her one of today’s most sought after and respected djs in both North America and Europe."},
{"name": "The Martinez Brothers", "links": ["https://soundcloud.com/themartinezbros"], "title": "House is a family thing", "country": "US", "venue": "Sónar by Night - SonarClub", "hour": "05:00 - 07:00", "link": "https://sonar.es/en/2016/artists/the-martinez-brothers", "day": "Friday 17", "description": "New York nightlife’s most infamous brothers will close one of the most important areas of the festival: Friday night at SonarClub, the main stage at Sónar by Night. To be bestowed with such an honour (and responsibility) does not happen by chance: Chris and Steve Jr. Martinez have already amassed years of experience making people dance and their excellence and adaptability to any given situation is guaranteed. They are equally adept at rocking a small basement club crowd in Brooklyn or 20,000 people at a large festival. Right now they are among the few DJs in the world capable of balancing the essence of the underground with an accessibility that attracts all types of audiences.\r\n\r\nThe Martinez brothers have achieved this rare prominence after many years of hard work. They began with secret raves in their native Bronx, later conquering the rest of the city, while gradually expanding their popularity at major nights in both Ibiza and Berlin. In recent years they have collaborated with the crème de la crème of house music and international techno; From Soul Clap and Seth Troxler, to working with Nile Rodgers on one of his latest tracks. They've also recorded a session for the legendary BBC Essential Mix and have released their own material -mostly in mixtape format- for free download. This work includes two volumes of 'Warhol*Basquiat', a humorous riff on the excesses of the today’s art market, and \"The Masters Collection Vol.1\" entitled Masters At Dutch. They are deservedly regarded as the new ambassadors of the New York house scene, following in the footsteps of giants like Todd Terry, Larry Levan, Kerri Chandler and Masters At Work."},
{"name": "The Spanish Dub Invasion feat. Mad Professor, Sr. Wilson, Lasai & George Palmer", "links": ["https://soundcloud.com/lasai_muzzik", "https://soundcloud.com/srwilsonofficial", "https://soundcloud.com/kenke-man-george-p"], "title": "Reggae-dub assault in SonarVillage﻿", "country": "ES-UK", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "15:30 - 16:30", "link": "https://sonar.es/en/2016/artists/the-spanish-dub-invasion-feat-mad-professor-sr-wilson-lasai-george-palmer", "day": "Thursday 16", "description": "Three of Spain’s chief representatives of reggae and dub -Sr. Wilson, Lasai and George Palmer- will join forces with the legendary Mad Professor (the original pioneer of British dub and roots and a leading figure on the international scene for more than three decades), in what will be an unprecedented high-flying project: The Spanish Dub Invasion. The Professor brings his immeasurable wisdom and deep bass chopses from the legendary Ariwa studios in London, where the three Spanish vocalists have travelled to deploy their repertoire of rhymes and melodies, each with their own characteristic flow. The project, now in its first steps, will perform their exciting show live at Sónar by Day, with a strong Jamaican heartbeat at its core and a sure-fire combination of euphoric reggae and hypnotic dub.\r\n\r\nA direct disciple of Lee Perry and a key figure in British dub, Mad Professor's work has been instrumental in the transition from the genre’s classical precepts towards the digital domain. His long career is full of memorable records and productions, both as a solo artist and in numerous collaborations (and remixes) for artists like Massive Attack, Sly & Robbie, Sade, Horace Andy, Beastie Boys, The KLF and The Orb. For this new project the grand master is joined by three of Spain’s most prominent \"singjays\": Catalonia's Mr. Wilson, Madrid's Lasai and Basque Country's George Palmer. The three have already released several records and have more than respectable music backgrounds, through sound systems and collectives including Badalonians Sound, Dremen or Bomb Bass Hi Fi, among others."},
{"name": "Toxe", "links": ["https://soundcloud.com/to-xe"], "title": "Unique sister", "country": "Staycore /  SE", "venue": "Sónar by Day - SonarDôme", "hour": "16:30 - 17:25", "link": "https://sonar.es/en/2016/artists/toxe", "day": "Saturday 18", "description": "Brought up in a creative milieu by artist parents, Toxe picked up most of her musical skills of her own accord, with a little help from her brother. Her tunes weld chattering drum beats with singed vocal loops and devouring treacle-thick sub-bass, never pausing for a second thought. Her debut EP was released on Stockholm label Staycore in 2015, and she spent much of that year playing parties across Sweden. In her spare time, she works on her own music videos, and is also a co-founder of Sister, a promotional online platform for female musicians in dance music."},
{"name": "Trill Squad: Toner + Sanatruja", "links": ["http://www.soundcloud.com/sanatruja", "https://soundcloud.com/tonermixtapes"], "title": "Hybridizations and futurisms", "country": "Trill /  ES", "venue": "Sónar by Night - SonarLab", "hour": "21:30 - 22:30", "link": "https://sonar.es/en/2016/artists/trill-squad-toner-sanatruja", "day": "Saturday 18", "description": "Trill is the future beats and hip-hop Saturday club night that has successfully been running for more than two years at Razzmatazz in Barcelona. Key figures to pass through its door include TroyBoi, Shlohmo, Evian Christ, Bauer, RP Boo and Yung Beef, among many others. But, like any great club,  the main strength of Trill is its residents: the Trill Squad is formed by a growing alliance of Barcelona DJs and producers such as Downites, Enpunto and Will Blake. On this occasion, the collective will arrive at Sónar with its two founding members, Toner and Sanatruja. They will offer a special set focused on the emotional spectrum of new electronica: from vaporwave to cloud rap, through to post-grime and all kinds of r&b hybridizations.\r\n\r\nToner has spent more than 10 years as resident DJ in Barcelona clubs (particularly BeCool and Razzmatazz) and has played at several national festivals. He is also in charge of the collective’s careful branding and image. Meanwhile Sanatruja (who returns to Sónar after his 2014 performance) also carries a wealth of experience behind the DJ booth in Razzmatazz, and is responsible for the Trill club night’s programming. Their joint set will open the SonarLab stage on Saturday night, right before the Mura Masa concert."},
{"name": "TroyBoi", "links": ["https://soundcloud.com/troyboi"], "title": "The new golden boy", "country": "Mad Decent /  UK", "venue": "Sónar by Day - SonarVillage by Estrella Damm", "hour": "19:00 - 20:15", "link": "https://sonar.es/en/2016/artists/troyboi", "day": "Saturday 18", "description": "TroyBoi burst onto the international scene with extraordinary ferocity, as if he had been waiting for the perfect moment to appear. It took just a few shrewd moves and uploads to Soundcloud for the London producer to be recognised as a new force in trap and global electronica, setting off alarm bells at several of the world’s most important record labels. Listening to his material it is easy to understand why: TroyBoi has an inimitable talent for hitting all the right notes, with adrenaline-laced bangers that work equally well in small clubs as large-scale festivals. His talent and progression is clearly demonstrated by the track \"Soundclash\", together with Flosstradamus in early 2015.\r\n\r\nAlthough typically associated with the trap genre, Troyboi’s sound moves beyond the confines of simplistic categorizations. In some of his tracks you will be able to hear original funk elements akin to Kaytranada (e.g. in \"Do You?\"); in others he plays with irresistible percussive drumbeats reminiscent of Hud Mo or Lunice, as well as including samples from Asian folklore; while some of his more recent hits have achieved huge success and openly appeal to larger and more commercial audiences, following in the footsteps of artists like Diplo. In fact, Diplo recently contacted him to collaborate on one of his latest successful songs, \"Afterhours\", which also featured Nina Sky. In just one year, Troyboi has also remixed Jack Ü (the Mad Decent heads' collaboration with Skrillex), and has worked with several other leading names from the international scene, including Timbaland and DJ Craze among others. He also created the SoundSnobz project together with comrade IceKream. If 2015 was his breakthrough year, 2016 will surely catapult him to international stardom."},
{"name": "Tuff City Kids", "links": [], "title": "German class", "country": "Unterton-Delsin /  DE", "venue": "Sónar by Day - SonarDôme", "hour": "21:00 - 22:00", "link": "https://sonar.es/en/2016/artists/tuff-city-kids", "day": "Thursday 16", "description": "Tuff City Kids is the production and performance duo of Phillip Lauer and Gerd Janson. In addition to releases of their own via Unterton, Delsin, Permanent Vacation and more, Tuff City Kids have become in-demand remixers as well, with a special talent for recontextualization that doesn’t distract from the eclectic energy they’re able to consistently supply - Azari & III, Tensnake, Sinkane, Avalon Emerson, Scuba and the Juan Maclean are just a small selection of the artists who have called on Tuff City Kids to supply sweaty grooves. In 2015, Tuff City Kids kept busy with releases via Live at Robert Johnson and Potion, as well as playing live all over the world. It’s an understated but effective duo, not making a big fuss out of their obvious talent and preferring to let the music do the talking."},
{"name": "Underground Resistance presents Timeline", "links": ["http://www.undergroundresistance.com"], "title": "Detroit’s legacy", "country": "Underground Resistance /  US", "venue": "Sónar by Day - SonarDôme", "hour": "19:10 - 20:20", "link": "https://sonar.es/en/2016/artists/underground-resistance-presents-timeline", "day": "Friday 17", "description": "Led by Underground Resistance founding member, Academy studio tutor and all-around badman ‘Mad’ Mike Banks, Timeline is the live band that’s keeping the name of the Detroit techno pioneers alive on the stages of this planet. Banks on keys is joined by Jon Dixon and De’Sean Jones of Galaxy 2 Galaxy on sax and more keys, plus DJ/producer Mark Flash, combining for a potent amalgam of jazz, house and true-school Motor City techno. Underground Resistance have been synonymous with uncompromising electronic music since the collective’s inception, and the Timeline project is an ongoing extension of their mission to further the legacy — and expand the definition — of black music from Detroit."},
{"name": "Undo", "links": ["https://soundcloud.com/undo", "https://djundo.bandcamp.com/"], "title": "Experience is a plus", "country": "Factory City /  ES", "venue": "Sónar by Night - SonarClub", "hour": "21:30 - 22:25", "link": "https://sonar.es/en/2016/artists/undo", "day": "Saturday 18", "description": "Few national DJs are better prepared to handle the opening set at SonarClub on Saturday night, just before the New Order concert. Gabriel Berlanga -the man better known as Undo- more than meets the requirements: a flawless technique, years of experience, extremely knowledgeable about electronic and techno-pop music, and fan of the band since their inception. More than two decades of experience in major clubs and events around the world allow him to adapt to any situation, especially when playing a landmark set such as this at Sónar by Night.\r\n\r\nBerlanga began collecting records, DJing and experimenting with electronic sounds in the mid-90s, playing around with old synthesizers, samplers and loop-guitar effects. However, it was not until 2002 that he began to write and produce under the name Undo. Founder of the Factor City label and resident for several years at The Loft / Lolita, the DJ and producer from Barcelona has released two LPS, \"Despacio\" (Factor City, 2006) and \"Motas de Polvo\" (Factor City, 2012); has remixed Delorean, Miss Kittin, Glimpse and Dorian, among many others; and has travelled the world, playing at clubs including Panorama Bar Berlin, the Rex in Paris and London’s Fabric. His most recent work is the \"Aeromuerto\" EP, released late last year on Berlin label Beachcoma."},
{"name": "Yung Lean", "links": ["http://yunglean.com", "https://soundcloud.com/yung-lean-doer"], "title": "The Evolution of an MC", "country": "YEAR0001 /  SE", "venue": "Sónar by Day - SonarHall", "hour": "16:30 - 17:30", "link": "https://sonar.es/en/2016/artists/yung-lean", "day": "Saturday 18", "description": "The leader of the Sad Boys collective, Yung Lean’s approach to the codes of hip-hop is characterized by his freedom and the lack of prejudice befitting an artist of his age (just 20 years old), and an outgoing personality with multiple influences. After a year of rest and reflection (his only releases being \"Crystal Clear Ice\" on Adult Swim and one remix), he is releasing a new album on February 25th, \"Warlord\", which has been already previewed with a coiple of new tracks, the upbeat \"Hoover\" in which he increases the tempo, and \"How You Like Me Now\" one of his typically slowed down narcotic trap tunes. Today’s Yung Lean toughens the bass, sharpens rhythms (now closer to techno) and raps candidly, without sacrificing the melancholic and emotional factor that formed part of his previous work. His live show at SonarHall will certainly confirm him as a fully evolved MC.\r\n\r\nYung Lean, real name Jonathan Leandoer, was born in Södermalm, Sweden. He is a clear example of today’s new breed of musicians, where the Internet has become the natural habitat from which to publicize and promote creativity. His tracks and aesthetic reveal several nods to the popular culture of the 90s and early 2000s: Michael Jordan and \"Space Jam\", the Nintendo 64, Transformers and Windows screensavers. Counting these influences and the originality of his lyrical flow is not surprising that several of his videos have reached a million views on Youtube, and his name is already commonly known on networks and websites tracking the very best in today’s electronica and hip-hop."},
{"name": "Zero vs. Chelis", "links": [], "title": "Two for the road", "country": "ES", "venue": "Sónar by Night - SonarPub", "hour": "21:45 - 22:45", "link": "https://sonar.es/en/2016/artists/zero-vs-chelis", "day": "Friday 17", "description": "Friday night at SonarPub couldn't possibly get off to a better start: a face-off between two of Spain’s most respected and admired Djs, Zero and Chelis. The Catalan and his Spanish brother in arms have known each other for years, crossing paths many times. However, while it is true they have shared the decks on some improvised occasions, they have never played together back to back in an \"official\" act. Their backgrounds and musical tastes are so wide ranging that they can integrate any genre and spectrum of sound they please: in this case, the idea is to join together a collage of beats, drones and library music, before the new live show from Anhoni with Oneohtrix Point Never and Hudson Mohawke.\r\n\r\nRaül G. Pratginestós, better known as Zero, is one of Spain’s most experienced and versatile Djs, a key figure in the Barcelona scene, unanimously respected by his peers since the early years of the electronic music explosion. He played at the very first Sónar, in 1994, and twenty years on his reputation remains undiminished. Meanwhile, Chelis has spent two decades imparting his passion, humour and unparalleled musical knowledge in each and every one of his dj sets, whatever style he plays (and he plays them all). He is also founder of label Lo Fi Funk, which operates in the territory of low-fidelity synthetic funk, one of his many passions."}]